{
  "backend/main.mo": "Main backend canister defining user profiles, KYC, payout methods, withdrawals, and gift card rate types with authorization and storage mixins, plus initial KYC submission and query functions.",
  "backend/migration.mo": "Migration module that maps old actor state to new actor state by adding an empty giftCardRates map.",
  "feature_evidence.json": "Empty feature evidence report JSON placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files describing utilities, components, pages, and hooks.",
  "frontend/BUILD_DEPLOY_TROUBLESHOOTING.md": "Guide outlining build and deployment steps, required tools, environment variables, and common troubleshooting tips.",
  "frontend/docs/betting-topup-video-checklist.md": "Checklist documenting all UI, state, and validation requirements for the betting top‑up flow implementation.",
  "frontend/docs/crypto-wallet-dashboard-checklist.md": "Checklist detailing required UI sections, components, and state handling for the crypto wallet dashboard.",
  "frontend/index.css": "Tailwind base/theme configuration defining OKLCH color tokens, dark mode variables, and global styles.",
  "frontend/index.html": "Basic HTML entry file mounting the frontend app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Defines the main app layout, handling authentication, registration flow, profile setup checks, and routing to all pages.",
  "frontend/src/backend-augment.d.ts": "Augments the backend actor interface with access-control initialization and role‑assignment methods.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Wraps admin-only routes, showing loading or access-denied states based on admin status.",
  "frontend/src/components/auth/AuthInitializingScreen.tsx": "Displays a loading screen while Internet Identity authentication initializes.",
  "frontend/src/components/auth/LoginCard.tsx": "Provides the login UI using Internet Identity with error handling and informational dialogs.",
  "frontend/src/components/crypto/CryptoActivityRow.tsx": "Renders a single crypto transaction row with icons, timestamp, amount, and status badge.",
  "frontend/src/components/crypto/CryptoActivitySection.tsx": "Loads, filters, and displays crypto-related local transactions with tabs and real-time updates.",
  "frontend/src/components/crypto/CryptoDashboardHeader.tsx": "Shows the crypto dashboard header with total balance and a visibility toggle.",
  "frontend/src/components/crypto/CryptoQuickActions.tsx": "Renders quick-action buttons for send, receive, buy, swap, and bank transfer operations.",
  "frontend/src/components/crypto/CryptoTokenList.tsx": "Lists crypto tokens with balances and icons, allowing optional click handling per token.",
  "frontend/src/components/crypto/sheets/BuyCryptoSheet.tsx": "Bottom sheet for selecting a crypto asset and USD amount to create a pending buy transaction.",
  "frontend/src/components/crypto/sheets/ReceiveCryptoSheet.tsx": "Sheet that lets users select a crypto asset, view a mock address, copy it, and logs a placeholder receive transaction.",
  "frontend/src/components/crypto/sheets/SendCryptoSheet.tsx": "Form for choosing an asset, entering a destination address and amount, and submitting a pending send transaction.",
  "frontend/src/components/crypto/sheets/SendToBankSheet.tsx": "Multi‑step flow for entering an amount, selecting or adding a payout method, and submitting a withdrawal request.",
  "frontend/src/components/crypto/sheets/SwapCryptoSheet.tsx": "UI for swapping one crypto asset for another with mock rates and logging a pending swap transaction.",
  "frontend/src/components/dashboard/DashboardPromoCard.tsx": "Promo card showing a global connectivity message with an illustration and dot indicators.",
  "frontend/src/components/dashboard/DashboardShortcutTile.tsx": "Reusable dashboard tile component showing an icon, label, optional badge, and click behavior or coming‑soon state.",
  "frontend/src/components/giftcards/GiftCardBrandRow.tsx": "Renders a clickable gift card brand row with icon fallback handling.",
  "frontend/src/components/giftcards/GiftCardLabelsChips.tsx": "Displays a limited set of label badges with a counter for remaining tags.",
  "frontend/src/components/giftcards/GiftCardLabelsEditor.tsx": "Provides UI to add, remove, and save editable gift card labels.",
  "frontend/src/components/giftcards/GiftCardLabelsFilterBar.tsx": "Implements a popover-based filter bar for selecting and clearing label filters.",
  "frontend/src/components/giftcards/GiftCardRateTable.tsx": "Shows a card with NGN rate tiers for a specific gift card brand.",
  "frontend/src/components/giftcards/NGNRateInlineSummary.tsx": "Displays an inline NGN rate summary or unavailable message for a matched tier.",
  "frontend/src/components/giftcards/SelectGiftCardCategoryPicker.tsx": "Bottom-sheet picker that filters and selects gift card brands via search.",
  "frontend/src/components/history/HistoryTransactionRow.tsx": "Renders a transaction row with icons, status badge, timestamps, and formatted amounts.",
  "frontend/src/components/kyc/DocumentSignatureOverlay.tsx": "Canvas-based signature overlay allowing drawing, stroke tracking, and exporting on top of an image.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with desktop sidebar, mobile header, navigation, and logout handling.",
  "frontend/src/components/layout/MobileBottomNavDock.tsx": "Renders a fixed mobile bottom navigation dock with route-based active state and navigation actions.",
  "frontend/src/components/payout/NigerianBankSelect.tsx": "Implements a searchable dropdown to select Nigerian banks using a popover and command list.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal for creating a basic user profile with name input and async profile creation.",
  "frontend/src/components/services/BillCategoryTile.tsx": "Clickable card component representing a bill payment category with icon and keyboard support.",
  "frontend/src/config/__tests__/nigerianBanks.test.ts": "Empty test file placeholder for Nigerian banks configuration tests.",
  "frontend/src/config/betting.ts": "Defines betting providers and preset amount chips for betting-related UI or logic.",
  "frontend/src/config/finance.ts": "Contains conversion rate config and a helper to calculate gross, fees, and net values.",
  "frontend/src/config/giftCardBrandCatalog.ts": "Provides a catalog of gift card brands with search metadata and icon paths, plus filtering.",
  "frontend/src/config/giftCardRatesNGN.ts": "Defines Nigeria gift card rate tables, brand overrides, and helpers for tier matching and formatting.",
  "frontend/src/config/nigerianBanks.ts": "Exports a list of Nigerian banks and utilities for normalized text search filtering.",
  "frontend/src/config/vendors.ts": "Defines vendor data with rates and fees and provides functions to compute payouts and choose the best vendor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Re-exports the hook for fetching the caller’s user profile.",
  "frontend/src/hooks/useDashboardData.ts": "Aggregates profile, KYC, cards, withdrawals, tags, and transactions into a unified dashboard data object.",
  "frontend/src/hooks/useEnsureUserRegistered.ts": "Ensures authenticated users are registered in backend access control, handling retries and role assignment.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, stored identities, and provides identity context to the app.",
  "frontend/src/hooks/useNotificationPermission.ts": "Tracks browser notification support and permission state and provides a method to request permission.",
  "frontend/src/hooks/useNotificationSettings.ts": "Manages per‑principal in‑app notification preferences stored in localStorage.",
  "frontend/src/hooks/useProfileSetupSuppression.ts": "Stores and retrieves whether a user has dismissed the profile-setup prompt using localStorage.",
  "frontend/src/hooks/useQueries.ts": "Provides data‑fetching and mapping helpers for profiles, KYC, withdrawals, gift cards, and related backend conversions.",
  "frontend/src/hooks/useWalletSummary.ts": "Provides quick access to the user’s primary wallet balance and currency.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables and utility classes.",
  "frontend/src/lib/utils.ts": "Provides class merging, currency formatting, and date formatting helpers.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/admin/AdminGiftCardRatesPage.tsx": "Provides an admin interface to list, create, edit, and toggle activation status for gift card rate entries using dialogs and query hooks.",
  "frontend/src/pages/admin/AdminKycReviewPage.tsx": "Allows admins to search users by principal ID, review their KYC records, and update KYC statuses while displaying related documents and status indicators.",
  "frontend/src/pages/admin/AdminWithdrawalsPage.tsx": "Displays pending withdrawal requests for admins to approve or reject, with status updates and loading indicators.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the main dashboard with balance, shortcuts, and promo sections, loading state, and navigation.",
  "frontend/src/pages/giftcards/__tests__/addGiftCardNGNRateSummary.test.tsx": "Empty test file placeholder for NGN rate summary behavior.",
  "frontend/src/pages/giftcards/addGiftCardNGNRate.ts": "Computes the NGN rate tier for a brand and amount by parsing input and matching against rate tables.",
  "frontend/src/pages/giftcards/AddGiftCardPage.tsx": "Form for adding new gift cards with brand selection, currency, image upload, and automatic NGN rate tier computation.",
  "frontend/src/pages/giftcards/GiftCardDetailPage.tsx": "Shows detailed gift card info, allows updating status and tags, and displays rate tables for the card’s brand.",
  "frontend/src/pages/giftcards/GiftCardsListPage.tsx": "Displays all gift cards with tag-based filtering, loading states, and navigation to add or view cards.",
  "frontend/src/pages/giftcards/HottestCardsPage.tsx": "Ranks and displays gift cards by best NGN rate, showing top cards and handling empty or loading states.",
  "frontend/src/pages/giftcards/hottestCardsRanking.ts": "Calculates best NGN rates for gift cards and returns a deterministically sorted ranking list.",
  "frontend/src/pages/giftcards/SellGiftCardPage.tsx": "Allows selling a specific gift card by calculating rates, selecting vendors, validating input, and showing conversion info.",
  "frontend/src/pages/HistoryPage.tsx": "Shows transaction history loaded from local state with live updates and navigation.",
  "frontend/src/pages/KycPage.tsx": "Handles KYC submission including file upload, signature capture, validation, and status display.",
  "frontend/src/pages/services/AirtimePage.tsx": "Form page to purchase airtime by selecting provider, entering phone and amount, and logging a local transaction.",
  "frontend/src/pages/services/BettingPage.tsx": "Handles betting top‑ups with a two‑step form, validation, confirmation, and local transaction logging.",
  "frontend/src/pages/services/BillsPage.tsx": "Renders a bills dashboard with category tiles that navigate to specific service pages.",
  "frontend/src/pages/services/CableTvBillsPage.tsx": "Provides a placeholder form for cable TV bill payments, logging a mock transaction.",
  "frontend/src/pages/services/CryptoWalletPage.tsx": "Displays a mock crypto wallet with balances, tokens, activity, and action sheets for send, receive, buy, swap, and bank transfer.",
  "frontend/src/pages/services/DataPage.tsx": "Implements a placeholder mobile data purchase form that records a mock transaction.",
  "frontend/src/pages/services/ElectricityPage.tsx": "Contains a placeholder electricity bill payment form that logs a mock transaction.",
  "frontend/src/pages/services/WifiInternetPage.tsx": "Provides a placeholder internet bill payment form that logs a mock transaction.",
  "frontend/src/pages/SettingsPage.tsx": "Provides settings for authentication info and notification preferences tied to Internet Identity.",
  "frontend/src/pages/withdrawals/WithdrawalsPage.tsx": "React page for viewing withdrawal requests, managing payout methods, and submitting new withdrawal requests with currency handling.",
  "frontend/src/state/localTransactions.ts": "Manages localStorage-backed temporary transaction records with add, load, and clear utilities.",
  "frontend/src/state/notificationSettingsStorage.ts": "Handles per-principal notification preference storage in localStorage with safe get/set helpers.",
  "frontend/src/types/app-types.ts": "Defines app-level TypeScript types for users, wallets, transactions, gift cards, KYC, payouts, and withdrawals.",
  "frontend/src/types/process-env.d.ts": "Declares TypeScript types for environment variables injected by Vite.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "TailwindCSS configuration with custom colors, animations, container settings, and plugins.",
  "frontend/vite.config.ts": "Vite config defining aliases, env shims, build chunking, dev server proxy, and optimization settings.",
  "project_state.json": "Project state file tracking schema version, goals, and requirements for adding a gift card rates backend system."
}