{
  "backend/main.mo": "Initializes access control and blob storage using mixins and exposes them in the actor.",
  "feature_evidence.json": "Contains feature evidence records mapping features to affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Lists summarized descriptions of various frontend files used elsewhere for reference.",
  "frontend/BUILD_DEPLOY_TROUBLESHOOTING.md": "Provides build and deployment steps plus troubleshooting guidance for environment variables and Internet Identity setup.",
  "frontend/index.css": "Tailwind base styles and OKLCH color tokens defining light and dark theme variables.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up routing, authentication checks, app shell, and conditional profile setup modal via TanStack Router.",
  "frontend/src/backend-augment.d.ts": "Extends generated backend TypeScript types to include the authorization initialization method.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Guards admin pages by checking admin status and rendering denial UI or children accordingly.",
  "frontend/src/components/auth/LoginCard.tsx": "Login card UI that triggers Internet Identity authentication with loading state and branding.",
  "frontend/src/components/dashboard/DashboardPromoCard.tsx": "Promotional dashboard card with illustration, fallback styling, and pagination dots.",
  "frontend/src/components/dashboard/DashboardShortcutTile.tsx": "Configurable dashboard shortcut tile with icon, optional badge, coming-soon state, and click behavior.",
  "frontend/src/components/giftcards/GiftCardBrandRow.tsx": "Clickable brand row showing icon and name with graceful fallback to a generic icon on load error.",
  "frontend/src/components/giftcards/GiftCardLabelsChips.tsx": "Displays a limited number of tag badges with an optional \"+N\" badge for remaining tags.",
  "frontend/src/components/giftcards/GiftCardLabelsEditor.tsx": "Provides UI to add, remove, and save gift card labels with change detection and loading states.",
  "frontend/src/components/giftcards/GiftCardLabelsFilterBar.tsx": "Offers a popover-based tag filter allowing users to search, select, and clear label filters.",
  "frontend/src/components/giftcards/GiftCardRateTable.tsx": "Renders a rate table showing NGN rates per tier for a selected gift card brand.",
  "frontend/src/components/giftcards/NGNRateInlineSummary.tsx": "Shows a compact NGN rate summary or an unavailable-rate warning based on matched tier data.",
  "frontend/src/components/giftcards/SelectGiftCardCategoryPicker.tsx": "Bottom sheet that lets users search and select gift card brands from a filtered list.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with navigation, mobile drawer menu, user info, and logout handling.",
  "frontend/src/components/layout/MobileBottomNavDock.tsx": "Provides a mobile bottom navigation dock with active route highlighting and coming-soon items.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal for creating a new user profile with name and username inputs and async submission.",
  "frontend/src/config/finance.ts": "Defines default conversion rates and a function to compute gross, fee, and net amounts with optional overrides.",
  "frontend/src/config/giftCardBrandCatalog.ts": "Defines gift card brand metadata and provides a filter function for searching brands.",
  "frontend/src/config/giftCardRatesNGN.ts": "Defines NGN rate tiers for gift cards, brand overrides, and helpers to select and format applicable tiers.",
  "frontend/src/config/vendors.ts": "Defines vendor payout configurations and selects the vendor yielding the highest net payout for a given amount.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Re-exports the hook for fetching the caller’s user profile.",
  "frontend/src/hooks/useDashboardData.ts": "Aggregates profile, KYC, cards, withdrawals, and transactions into a unified dashboard data object.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, and state management utilities.",
  "frontend/src/hooks/useProfileSetupSuppression.ts": "Manages local storage–based suppression state for profile setup prompts keyed by principal.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, gift cards, and KYC/withdrawal features, mostly with unimplemented backend calls. Includes mutations that invalidate relevant queries.",
  "frontend/src/hooks/useWalletSummary.ts": "Extracts wallet balance and currency from the current user's profile and returns them with loading state.",
  "frontend/src/index.css": "Configures Tailwind layers and CSS variables for light/dark themes and global styles.",
  "frontend/src/lib/utils.ts": "Provides utility functions for merging class names, formatting currency values, and formatting timestamps into human-readable strings.",
  "frontend/src/main.tsx": "Initializes the React root, wraps the app with React Query and Internet Identity providers, and loads global styles.",
  "frontend/src/pages/admin/AdminKycReviewPage.tsx": "Admin page scaffold for searching a user by principal and reviewing KYC submissions, wrapped in an admin route guard.",
  "frontend/src/pages/admin/AdminWithdrawalsPage.tsx": "Admin interface to view pending withdrawals and approve or reject them using query mutations.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the main dashboard with balance info, quick-action shortcuts, and loading skeletons.",
  "frontend/src/pages/giftcards/__tests__/addGiftCardNGNRateSummary.test.tsx": "Empty test file placeholder for NGN rate summary tests.",
  "frontend/src/pages/giftcards/addGiftCardNGNRate.ts": "Helper function that computes the matching NGN rate tier for a brand and amount.",
  "frontend/src/pages/giftcards/AddGiftCardPage.tsx": "Form page for creating a gift card with brand selection, currency, amount, code, image upload, and NGN rate tier preview.",
  "frontend/src/pages/giftcards/GiftCardDetailPage.tsx": "Displays detailed gift card info, allows status updates, tag editing, and shows NGN rate table for the brand.",
  "frontend/src/pages/giftcards/GiftCardsListPage.tsx": "Lists all gift cards with tag filtering, basic card info, and navigation to add or view individual cards.",
  "frontend/src/pages/giftcards/SellGiftCardPage.tsx": "Sell flow for a gift card including amount entry, vendor selection, conversion calculation, and NGN rate tier lookup.",
  "frontend/src/pages/KycPage.tsx": "Handles user KYC submission with file upload, form state, status display, and submission via query hooks.",
  "frontend/src/pages/services/AirtimePage.tsx": "Placeholder page for buying airtime, logging a local transaction after basic form submission.",
  "frontend/src/pages/services/BettingPage.tsx": "Placeholder page for betting account top‑ups, logging a local transaction after form submission.",
  "frontend/src/pages/services/BillsPage.tsx": "Renders a placeholder bills payment form that logs a local 'bills' transaction after validation and a mock delay.",
  "frontend/src/pages/services/CryptoWalletPage.tsx": "Provides a placeholder crypto transfer form that logs a local 'crypto' transaction using a mock processing delay.",
  "frontend/src/pages/services/DataPage.tsx": "Implements a placeholder mobile data purchase form that records a local 'data' transaction after basic validation.",
  "frontend/src/pages/withdrawals/WithdrawalsPage.tsx": "Handles viewing withdrawals, submitting withdrawal requests, and managing payout methods using query hooks and form inputs.",
  "frontend/src/state/localTransactions.ts": "Manages local transaction storage with functions to add, retrieve, and clear up to 50 recent transactions in localStorage.",
  "frontend/src/types/app-types.ts": "Defines TypeScript types for currencies, users, wallets, transactions, gift cards, KYC records, payout methods, and withdrawals.",
  "frontend/src/types/process-env.d.ts": "Declares TypeScript typings for environment variables used by the frontend, including Internet Identity settings.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and plugins including typography, container queries, and animate.",
  "frontend/vite.config.ts": "Vite configuration enabling React, path aliases, env variable shims, build chunking, dev server proxying, and dependency optimization.",
  "project_state.json": "Project state metadata describing a fix request for missing NGN rate display and listing existing related features and issues."
}