{
  "backend/main.mo": "Main backend canister implementing KYC, payout methods, and withdrawals with access control, storage mixins, and migration support.",
  "backend/migration.mo": "Defines a migration module resetting KYC records and IDs during upgrades.",
  "feature_evidence.json": "Feature evidence report mapping required frontend feature work to specific files and components with test IDs.",
  "frontend-file-summaries.txt": "Auto-generated summaries of various frontend files describing their responsibilities and behaviors.",
  "frontend/BUILD_DEPLOY_TROUBLESHOOTING.md": "Guide for building and deploying the app with steps for local and production environments and required environment variables.",
  "frontend/docs/betting-topup-video-checklist.md": "Checklist documenting all UI and logic requirements for implementing the betting top-up flow.",
  "frontend/docs/crypto-wallet-dashboard-checklist.md": "Checklist detailing required UI sections and behaviors for the crypto wallet dashboard.",
  "frontend/index.css": "Global Tailwind-based CSS defining design tokens, theming variables, and base styles for light and dark modes.",
  "frontend/index.html": "Base HTML document that loads the frontend React application.",
  "frontend/src/App.tsx": "Defines the main app layout and routing, handling authentication, profile setup modal logic, and all page routes.",
  "frontend/src/backend-augment.d.ts": "Augments the backend actor interface with an authorization initialization method for setting the first admin user.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Checks if the caller is an admin and either shows restricted-access UI or renders protected children.",
  "frontend/src/components/auth/LoginCard.tsx": "Renders an Internet Identity login screen with a visual email/password form and info dialog triggers.",
  "frontend/src/components/crypto/CryptoActivityRow.tsx": "Displays a single crypto transaction row with icon, timestamp, amount, and status badge.",
  "frontend/src/components/crypto/CryptoActivitySection.tsx": "Loads and filters local crypto transactions, showing activity lists with tabs and skeleton states.",
  "frontend/src/components/crypto/CryptoDashboardHeader.tsx": "Shows a styled crypto dashboard header with balance visibility toggle and background artwork.",
  "frontend/src/components/crypto/CryptoQuickActions.tsx": "Provides quick-access action buttons for crypto operations like send, receive, buy, swap, and bank transfer.",
  "frontend/src/components/crypto/CryptoTokenList.tsx": "Lists crypto tokens with icons, balances, and click handling for selecting an asset.",
  "frontend/src/components/crypto/sheets/BuyCryptoSheet.tsx": "Form sheet for selecting a crypto asset and USD amount to create a pending local 'buy' transaction.",
  "frontend/src/components/crypto/sheets/ReceiveCryptoSheet.tsx": "Sheet for selecting a crypto asset, displaying a mock receive address, copying it, and logging a placeholder receive transaction.",
  "frontend/src/components/crypto/sheets/SendCryptoSheet.tsx": "Form sheet to send crypto by selecting an asset, entering a destination address and amount, and creating a pending send transaction.",
  "frontend/src/components/crypto/sheets/SendToBankSheet.tsx": "Multi‑step sheet for withdrawing funds to a bank account, including amount entry, payout method selection/creation, and withdrawal submission.",
  "frontend/src/components/crypto/sheets/SwapCryptoSheet.tsx": "Sheet for swapping between two crypto assets using a mock rate and creating a pending swap transaction.",
  "frontend/src/components/dashboard/DashboardPromoCard.tsx": "Dashboard promo card with text, illustration, and dot indicators, including fallback styling if the image fails.",
  "frontend/src/components/dashboard/DashboardShortcutTile.tsx": "Reusable dashboard tile with icon, label, optional badge, and click behavior, supporting disabled 'coming soon' states.",
  "frontend/src/components/giftcards/GiftCardBrandRow.tsx": "Renders a selectable gift card brand row with an icon fallback and name label.",
  "frontend/src/components/giftcards/GiftCardLabelsChips.tsx": "Displays up to a set number of tag badges with a counter for additional tags.",
  "frontend/src/components/giftcards/GiftCardLabelsEditor.tsx": "Provides UI to add, remove, and save custom gift card labels with save-state handling.",
  "frontend/src/components/giftcards/GiftCardLabelsFilterBar.tsx": "Implements a filter bar with searchable tag selection and options to toggle or clear filters.",
  "frontend/src/components/giftcards/GiftCardRateTable.tsx": "Shows NGN rate tiers for a gift card brand in a table format.",
  "frontend/src/components/giftcards/NGNRateInlineSummary.tsx": "Displays an inline NGN rate summary or an unavailable notice based on matched tiers.",
  "frontend/src/components/giftcards/SelectGiftCardCategoryPicker.tsx": "A bottom-sheet picker allowing users to search and select a gift card brand.",
  "frontend/src/components/history/HistoryTransactionRow.tsx": "Renders a transaction row with icon, timestamp, amount formatting, and status badge.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with desktop sidebar, mobile header, navigation, and logout handling.",
  "frontend/src/components/layout/MobileBottomNavDock.tsx": "Provides a mobile bottom navigation dock with route-aware highlighting.",
  "frontend/src/components/payout/NigerianBankSelect.tsx": "Searchable dropdown component for selecting Nigerian banks with filtering and popover UI.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal for creating a user profile, handling name input, submission, and loading states.",
  "frontend/src/components/services/BillCategoryTile.tsx": "Clickable card UI tile displaying a bill category icon and label with keyboard support.",
  "frontend/src/config/betting.ts": "Defines betting providers list and preset amount chip values.",
  "frontend/src/config/finance.ts": "Provides conversion rate config and a function to compute gross, fee, and net values.",
  "frontend/src/config/giftCardBrandCatalog.ts": "Catalog of gift card brands with search terms and icons, plus brand filtering utility.",
  "frontend/src/config/giftCardRatesNGN.ts": "Defines NGN gift card rate tables, brand overrides, and utilities for matching and formatting tiers.",
  "frontend/src/config/nigerianBanks.ts": "Contains a list of Nigerian banks and a helper to filter them by search query.",
  "frontend/src/config/vendors.ts": "Defines vendor payout configs and selects the best vendor based on net payout.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity and refreshes dependent queries.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Re-exports hook for fetching the caller's user profile.",
  "frontend/src/hooks/useDashboardData.ts": "Aggregates profile, KYC, cards, withdrawals, and transactions into a dashboard data object.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and identity loading from storage.",
  "frontend/src/hooks/useNotificationPermission.ts": "Detects browser notification support, tracks permission state, and exposes a safe async permission request function.",
  "frontend/src/hooks/useNotificationSettings.ts": "Manages per‑principal in‑app notification preference, syncing with localStorage and providing a toggle method.",
  "frontend/src/hooks/useProfileSetupSuppression.ts": "Stores and retrieves per‑principal suppression of the profile setup prompt using localStorage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks and mapping helpers for fetching and transforming backend user, KYC, payout, and withdrawal data.",
  "frontend/src/hooks/useWalletSummary.ts": "Fetches the caller’s profile and returns primary wallet balance, currency, and loading state.",
  "frontend/src/index.css": "Tailwind CSS setup with custom design tokens for light and dark themes plus global styles.",
  "frontend/src/lib/utils.ts": "Utility functions for class merging, currency formatting across multiple currencies, and date formatting.",
  "frontend/src/main.tsx": "App entrypoint initializing React Query and Internet Identity providers before rendering the root App component.",
  "frontend/src/pages/admin/AdminKycReviewPage.tsx": "Allows admins to search users, review their KYC submissions, view documents, and update verification status.",
  "frontend/src/pages/admin/AdminWithdrawalsPage.tsx": "Admin page listing pending withdrawals with options to approve or reject each request and displaying processing states.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard UI displaying balance, shortcuts, and loading states, with toggling for balance visibility and navigation links.",
  "frontend/src/pages/giftcards/__tests__/addGiftCardNGNRateSummary.test.tsx": "Empty test file placeholder for NGN rate summary logic.",
  "frontend/src/pages/giftcards/addGiftCardNGNRate.ts": "Exports a helper that parses an amount and computes the matched NGN rate tier for a given brand.",
  "frontend/src/pages/giftcards/AddGiftCardPage.tsx": "Form for adding new gift cards with brand selection, rate tier computation, optional image upload, and submission to the backend.",
  "frontend/src/pages/giftcards/GiftCardDetailPage.tsx": "Displays detailed info for a single gift card, including status, tags, and NGN rate table, with options to update status and labels.",
  "frontend/src/pages/giftcards/GiftCardsListPage.tsx": "Shows a filterable list of all gift cards with tag-based filtering and navigation to add or view cards.",
  "frontend/src/pages/giftcards/HottestCardsPage.tsx": "Ranks gift cards by their best NGN rate and displays them in a sortable, navigable grid.",
  "frontend/src/pages/giftcards/hottestCardsRanking.ts": "Computes and sorts gift cards by best NGN rate and provides utilities for rate extraction.",
  "frontend/src/pages/giftcards/SellGiftCardPage.tsx": "Allows selling a gift card by entering an amount, selecting a vendor, and viewing calculated conversion details.",
  "frontend/src/pages/HistoryPage.tsx": "Displays local transaction history, listens for updates, and renders a list or empty state with navigation back to the dashboard.",
  "frontend/src/pages/KycPage.tsx": "Fetches and submits KYC records, handles document upload with progress tracking, and displays current KYC status and submission form.",
  "frontend/src/pages/services/AirtimePage.tsx": "Form for purchasing airtime by selecting provider, entering phone and amount, and logging a local transaction.",
  "frontend/src/pages/services/BettingPage.tsx": "A two-step betting top‑up form that collects provider, account ID, and amount, then logs a pending transaction.",
  "frontend/src/pages/services/BillsPage.tsx": "Displays bill payment categories and navigates to specific service pages like airtime, data, electricity, and betting.",
  "frontend/src/pages/services/CableTvBillsPage.tsx": "A placeholder cable TV payment form that logs a mock transaction using smartcard number and amount.",
  "frontend/src/pages/services/CryptoWalletPage.tsx": "Shows a crypto wallet dashboard with mock token data, quick actions, and modal sheets for send, receive, buy, swap, and bank transfer.",
  "frontend/src/pages/services/DataPage.tsx": "A placeholder mobile data purchase form that logs a mock transaction using phone number and amount.",
  "frontend/src/pages/services/ElectricityPage.tsx": "A placeholder electricity bill payment form that logs a mock transaction using meter number and amount.",
  "frontend/src/pages/services/WifiInternetPage.tsx": "React page for logging placeholder internet bill payments, capturing account ID and amount, and storing them as local transactions.",
  "frontend/src/pages/SettingsPage.tsx": "Shows user authentication details and manages notification preferences using Internet Identity and browser notification permissions.",
  "frontend/src/pages/withdrawals/WithdrawalsPage.tsx": "UI for viewing withdrawals, adding payout methods, and submitting withdrawal requests with currency selection and status handling.",
  "frontend/src/state/localTransactions.ts": "Manages local transaction storage with add, get, and clear helpers using localStorage and auto‑generated IDs.",
  "frontend/src/state/notificationSettingsStorage.ts": "Handles per‑principal notification settings via scoped localStorage keys with safe get/set operations.",
  "frontend/src/types/app-types.ts": "Defines app-wide TypeScript types for users, wallets, transactions, gift cards, payout methods, withdrawals, and currency variants.",
  "frontend/src/types/process-env.d.ts": "Type declarations for process.env variables used by the frontend and shimmed by Vite.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, layout settings, and enabling several plugins.",
  "frontend/vite.config.ts": "Vite configuration enabling React, path aliases, env shims, build output settings, dev server proxying, and optimized deps.",
  "project_state.json": "Defines the project's current state and requirements for implementing a full KYC verification workflow across frontend and backend. Lists existing features, new feature requests, and project metadata related to KYC data models, APIs, and UI updates."
}