{
  "backend/main.mo": "Defines the backend actor for payout methods and withdrawal requests with access control, storage mixins, and CRUD-style methods for users.",
  "backend/migration.mo": "Implements a migration that initializes payout method and withdrawal request maps and counters on upgrade.",
  "feature_evidence.json": "Lists implemented features, associated source files, components, and test IDs with confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend files describing their purpose and behavior.",
  "frontend/BUILD_DEPLOY_TROUBLESHOOTING.md": "Provides build and deployment steps plus troubleshooting guidance for local and production environments.",
  "frontend/docs/crypto-wallet-dashboard-checklist.md": "Outlines all UI elements and states required for the crypto wallet dashboard and marks completed items.",
  "frontend/index.css": "Defines global Tailwind CSS layers and OKLCH-based design tokens for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Configures the app router, authentication gate, profile setup modal logic, and page route definitions.",
  "frontend/src/backend-augment.d.ts": "Extends the backend interface with a method for initializing access control using a secret token.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Guards admin-only routes by checking admin status and showing loading or access denied states.",
  "frontend/src/components/auth/LoginCard.tsx": "Displays a login card with Internet Identity authentication and a loading state.",
  "frontend/src/components/crypto/CryptoActivityRow.tsx": "Renders a single crypto transaction row with icon, timestamp, amount, and status badge.",
  "frontend/src/components/crypto/CryptoActivitySection.tsx": "Shows a list of crypto transactions with filters, loading states, and real-time updates.",
  "frontend/src/components/crypto/CryptoDashboardHeader.tsx": "Displays a styled header showing total crypto balance with a visibility toggle.",
  "frontend/src/components/crypto/CryptoQuickActions.tsx": "Provides a horizontal list of quick-action buttons like Send, Receive, Buy, Swap, and Send to Bank.",
  "frontend/src/components/crypto/CryptoTokenList.tsx": "Lists crypto tokens with icons, balances, and optional click handling.",
  "frontend/src/components/crypto/sheets/BuyCryptoSheet.tsx": "Bottom sheet for buying crypto, validating input, and creating a pending local transaction.",
  "frontend/src/components/crypto/sheets/ReceiveCryptoSheet.tsx": "Bottom sheet for selecting an asset, showing a mock receive address, copying it, and logging a placeholder transaction.",
  "frontend/src/components/crypto/sheets/SendCryptoSheet.tsx": "Form sheet for sending crypto, handling asset selection, address input, amount entry, and creating a local pending transaction.",
  "frontend/src/components/crypto/sheets/SendToBankSheet.tsx": "Multi‑step sheet for withdrawing funds to a bank, including amount entry, payout method selection or creation, and submission via API hooks.",
  "frontend/src/components/crypto/sheets/SwapCryptoSheet.tsx": "Sheet for swapping between two crypto assets with mock rate calculation and adding a pending local transaction.",
  "frontend/src/components/dashboard/DashboardPromoCard.tsx": "Promo card showing a marketing message with an illustration fallback and pagination dots.",
  "frontend/src/components/dashboard/DashboardShortcutTile.tsx": "Clickable or disabled dashboard shortcut tile with icon, label, optional badge, and support for various sizes.",
  "frontend/src/components/giftcards/GiftCardBrandRow.tsx": "Row component displaying a gift card brand with fallback icon and click interaction.",
  "frontend/src/components/giftcards/GiftCardLabelsChips.tsx": "Renders up to a limited number of label chips with a counter for remaining tags.",
  "frontend/src/components/giftcards/GiftCardLabelsEditor.tsx": "UI for adding, removing, and saving gift card labels with change detection and loading state.",
  "frontend/src/components/giftcards/GiftCardLabelsFilterBar.tsx": "Provides a UI popover for filtering gift cards by selectable tags with search and clear-all options.",
  "frontend/src/components/giftcards/GiftCardRateTable.tsx": "Renders a table showing NGN gift card rate tiers for a given brand.",
  "frontend/src/components/giftcards/NGNRateInlineSummary.tsx": "Displays an inline NGN rate summary or an unavailable notice for a matched tier.",
  "frontend/src/components/giftcards/SelectGiftCardCategoryPicker.tsx": "Bottom sheet picker allowing users to search and select a gift card brand.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application layout with navigation, side sheet menu, and logout handling.",
  "frontend/src/components/layout/MobileBottomNavDock.tsx": "Mobile bottom navigation dock providing quick access to key app sections with some items marked coming soon.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal for creating a new user profile with name and username input and async submission.",
  "frontend/src/components/services/BillCategoryTile.tsx": "Clickable tile component for selecting a bill payment category with icon and label.",
  "frontend/src/config/finance.ts": "Defines conversion rate and fee settings and provides a function to compute gross, fee, and net amounts.",
  "frontend/src/config/giftCardBrandCatalog.ts": "Defines the GiftCardBrand interface and a catalog of gift card brands with search terms and icons, plus helpers for filtering and a generic icon path.",
  "frontend/src/config/giftCardRatesNGN.ts": "Defines NGN gift card rate tiers, brand overrides, and utilities for selecting rate tables, matching tiers, and formatting rates.",
  "frontend/src/config/vendors.ts": "Provides vendor configurations with rates and fees and includes logic to compute payouts and select the best vendor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Re-exports the useGetCallerUserProfile hook.",
  "frontend/src/hooks/useDashboardData.ts": "Aggregates profile, KYC, gift card, withdrawal, and transaction data into a unified dashboard state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useProfileSetupSuppression.ts": "Tracks per‑principal suppression of profile setup prompts using localStorage with helpers to suppress or unsuppress.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, gift cards, and withdrawals, currently returning placeholders due to unimplemented backend methods.",
  "frontend/src/hooks/useWalletSummary.ts": "Fetches current user profile and extracts primary wallet balance and currency.",
  "frontend/src/index.css": "Defines Tailwind base, utility layers, and theme CSS variables for light and dark modes.",
  "frontend/src/lib/utils.ts": "Utility functions for class merging, currency formatting, and date formatting.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/admin/AdminKycReviewPage.tsx": "Admin page for searching users and reviewing KYC submissions, wrapped in a route guard.",
  "frontend/src/pages/admin/AdminWithdrawalsPage.tsx": "Admin interface to review, approve, or reject pending withdrawals with status updates.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard showing wallet balance, shortcuts, and loading states.",
  "frontend/src/pages/giftcards/__tests__/addGiftCardNGNRateSummary.test.tsx": "Empty test file placeholder for NGN rate summary logic.",
  "frontend/src/pages/giftcards/addGiftCardNGNRate.ts": "Exports a helper that parses an amount and returns the matching NGN rate tier for a brand.",
  "frontend/src/pages/giftcards/AddGiftCardPage.tsx": "Form to add a new gift card, including brand selection, rate display, and optional image upload.",
  "frontend/src/pages/giftcards/GiftCardDetailPage.tsx": "Displays detailed gift card info, allows updating status, managing labels, and viewing applicable NGN rate tiers.",
  "frontend/src/pages/giftcards/GiftCardsListPage.tsx": "Shows a filterable list of gift cards with tag-based filtering and navigation to add or view cards.",
  "frontend/src/pages/giftcards/SellGiftCardPage.tsx": "Provides UI for selling a gift card, including vendor selection, rate matching, and conversion calculations.",
  "frontend/src/pages/KycPage.tsx": "Displays KYC status and form for submitting identity documents with upload handling.",
  "frontend/src/pages/services/AirtimePage.tsx": "Form for purchasing airtime, validating inputs, and logging a local transaction.",
  "frontend/src/pages/services/BettingPage.tsx": "Placeholder betting top‑up form that logs a local transaction and displays a coming‑soon notice.",
  "frontend/src/pages/services/BillsPage.tsx": "Landing page listing bill‑payment categories and navigating to their respective pages.",
  "frontend/src/pages/services/CableTvBillsPage.tsx": "Form UI for logging placeholder cable TV bill payments and storing them as local transactions.",
  "frontend/src/pages/services/CryptoWalletPage.tsx": "Displays a mock crypto wallet dashboard with token balances, activity, and action sheets for sending, receiving, buying, swapping, and withdrawing crypto.",
  "frontend/src/pages/services/DataPage.tsx": "Form UI for logging placeholder mobile data purchases and saving them as local transactions.",
  "frontend/src/pages/services/ElectricityPage.tsx": "Form for placeholder electricity bill payments that records transactions locally.",
  "frontend/src/pages/services/WifiInternetPage.tsx": "Form for logging placeholder WiFi or internet bill payments as local transactions.",
  "frontend/src/pages/withdrawals/WithdrawalsPage.tsx": "Manages withdrawal requests and payout methods with forms, server mutations, and status displays.",
  "frontend/src/state/localTransactions.ts": "Local storage utility for adding, retrieving, and clearing up to 50 locally saved transactions.",
  "frontend/src/types/app-types.ts": "Defines TypeScript data models for users, wallets, transactions, gift cards, KYC records, payout methods, and withdrawals used by the frontend.",
  "frontend/src/types/process-env.d.ts": "Declares TypeScript types for environment variables II_URL and II_DERIVATION_ORIGIN.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and sessionStorage parameters in both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "frontend/vite.config.ts": "Sets up Vite with React, path aliases, env var shims, build chunking, dev proxying, and dependency optimization.",
  "project_state.json": "Stores the project’s feature list, new requests, metadata, and versioned state."
}