{
  "backend/main.mo": "Motoko backend actor managing user profiles, payout methods, and withdrawal requests with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping UI/auth tasks to impacted files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-like list summarizing major frontend files and their responsibilities across UI, pages, hooks, and components.",
  "frontend/BUILD_DEPLOY_TROUBLESHOOTING.md": "Guide explaining how to build, deploy, and troubleshoot the app with DFX, environment variables, and common commands.",
  "frontend/docs/betting-topup-video-checklist.md": "Checklist documenting required UI, states, validations, and flow for the betting top‑up implementation.",
  "frontend/docs/crypto-wallet-dashboard-checklist.md": "Checklist covering all UI elements, interactions, and data behaviors for the crypto wallet dashboard.",
  "frontend/index.css": "Tailwind base/styles defining theme tokens, light/dark variables, and global styling rules.",
  "frontend/index.html": "HTML entry point loading the root container and frontend application script.",
  "frontend/src/App.tsx": "Defines the root layout, authentication gate, profile-setup modal logic, and full TanStack router configuration for app pages.",
  "frontend/src/backend-augment.d.ts": "Augments the backend actor interface to include an initialization method for access control with a secret token.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Provides an admin-only route wrapper that shows loading skeletons or an access-denied message before rendering protected content.",
  "frontend/src/components/auth/LoginCard.tsx": "Implements a login screen using Internet Identity with disabled mock email/password UI and a dialog for signup/forgot-password info.",
  "frontend/src/components/crypto/CryptoActivityRow.tsx": "Renders a single crypto transaction row with icon, timestamp formatting, amount, and status badge.",
  "frontend/src/components/crypto/CryptoActivitySection.tsx": "Loads, filters, and displays local crypto transactions with tabs for all/sent/received and real-time storage updates.",
  "frontend/src/components/crypto/CryptoDashboardHeader.tsx": "Shows the crypto balance header with a styled background and a toggle to hide or reveal the displayed balance.",
  "frontend/src/components/crypto/CryptoQuickActions.tsx": "Renders a horizontal action bar for common crypto operations like send, receive, buy, swap, and bank transfer.",
  "frontend/src/components/crypto/CryptoTokenList.tsx": "Displays a list of crypto tokens with icons, balances, and click handling, falling back to a generic icon on load errors.",
  "frontend/src/components/crypto/sheets/BuyCryptoSheet.tsx": "Buy crypto sheet with asset selection, amount input, validation, and creation of a pending local transaction.",
  "frontend/src/components/crypto/sheets/ReceiveCryptoSheet.tsx": "Receive crypto sheet allowing asset selection, address display, clipboard copy, and logging a placeholder received transaction.",
  "frontend/src/components/crypto/sheets/SendCryptoSheet.tsx": "Send crypto sheet with asset selection, address and amount inputs, and creation of a pending sent transaction.",
  "frontend/src/components/crypto/sheets/SendToBankSheet.tsx": "Multi‑step flow for withdrawing funds to a bank, including amount entry, payout method selection or creation, and final review.",
  "frontend/src/components/crypto/sheets/SwapCryptoSheet.tsx": "Swap crypto sheet enabling asset pair selection, amount entry, mock conversion, and creation of a swap transaction.",
  "frontend/src/components/dashboard/DashboardPromoCard.tsx": "Dashboard promotional card with illustration and pagination dots encouraging eSIM connectivity.",
  "frontend/src/components/dashboard/DashboardShortcutTile.tsx": "Reusable dashboard tile component with icon, label, optional route, badge, and coming‑soon state.",
  "frontend/src/components/giftcards/GiftCardBrandRow.tsx": "Displays a clickable gift card brand row with icon fallback and name.",
  "frontend/src/components/giftcards/GiftCardLabelsChips.tsx": "Renders up to a set number of label chips with an overflow counter.",
  "frontend/src/components/giftcards/GiftCardLabelsEditor.tsx": "Provides UI to add, remove, and save custom gift card labels with change detection.",
  "frontend/src/components/giftcards/GiftCardLabelsFilterBar.tsx": "Offers a popover-based interface for filtering gift cards by selectable labels.",
  "frontend/src/components/giftcards/GiftCardRateTable.tsx": "Shows a card-styled table of NGN rate tiers for a specific gift card brand.",
  "frontend/src/components/giftcards/NGNRateInlineSummary.tsx": "Displays an inline summary of the matched NGN rate tier or an unavailable notice.",
  "frontend/src/components/giftcards/SelectGiftCardCategoryPicker.tsx": "Bottom sheet picker allowing users to search and select gift card brands.",
  "frontend/src/components/history/HistoryTransactionRow.tsx": "Renders a transaction row with icon, timestamp, amount formatting, and status badge.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with desktop sidebar, mobile header, navigation, and logout handling.",
  "frontend/src/components/layout/MobileBottomNavDock.tsx": "Provides a mobile bottom navigation dock with route-aware highlighting.",
  "frontend/src/components/payout/NigerianBankSelect.tsx": "Dropdown component for selecting Nigerian banks with search and popover UI.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal for creating a user profile with name input and async submit handling.",
  "frontend/src/components/services/BillCategoryTile.tsx": "Clickable tile displaying a bill category with icon and label.",
  "frontend/src/config/betting.ts": "Defines betting providers and preset amount chips for betting services.",
  "frontend/src/config/finance.ts": "Contains conversion rate config and a function to compute gross, fee, and net values.",
  "frontend/src/config/giftCardBrandCatalog.ts": "Catalog of gift card brands with icons and search terms plus a filter function.",
  "frontend/src/config/giftCardRatesNGN.ts": "NGN rate table config for gift cards, with helpers to get tiers, match amounts, and format labels.",
  "frontend/src/config/nigerianBanks.ts": "List of Nigerian banks and a function to filter them by search query.",
  "frontend/src/config/vendors.ts": "Vendor list with rates and logic to calculate payouts and select the best vendor.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on II identity and refreshes dependent queries.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Re-exports hook for fetching the current user's profile.",
  "frontend/src/hooks/useDashboardData.ts": "Aggregates profile, KYC, gift cards, withdrawals, and transactions into dashboard-ready data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, including loading stored identities, handling login state, and configuring AuthClient.",
  "frontend/src/hooks/useNotificationPermission.ts": "Checks browser notification support, tracks permission state, and offers a safe async method to request permission.",
  "frontend/src/hooks/useNotificationSettings.ts": "Manages per‑principal notification preferences stored in localStorage with a toggle API.",
  "frontend/src/hooks/useProfileSetupSuppression.ts": "Tracks whether a user has dismissed profile setup using localStorage and exposes suppress/unsuppress helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, gift cards, and withdrawals, including client‑side mapping between backend and frontend types.",
  "frontend/src/hooks/useWalletSummary.ts": "Extracts wallet balance and currency from the current user profile for display.",
  "frontend/src/index.css": "Tailwind CSS setup defining global theme variables and light/dark mode styles.",
  "frontend/src/lib/utils.ts": "Contains utility helpers for class merging, currency formatting, and date formatting.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/admin/AdminKycReviewPage.tsx": "Admin interface to search users, view their KYC records, and update their KYC status.",
  "frontend/src/pages/admin/AdminWithdrawalsPage.tsx": "Admin page listing pending withdrawals with actions to approve or reject them.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard UI showing balance, shortcuts, and promo sections with loading states and currency formatting.",
  "frontend/src/pages/giftcards/__tests__/addGiftCardNGNRateSummary.test.tsx": "Empty test file placeholder.",
  "frontend/src/pages/giftcards/addGiftCardNGNRate.ts": "Computes the NGN rate tier for a brand and amount by parsing input and matching rate table tiers.",
  "frontend/src/pages/giftcards/AddGiftCardPage.tsx": "Form for adding a gift card with brand selection, amount, code, and optional image upload.",
  "frontend/src/pages/giftcards/GiftCardDetailPage.tsx": "Displays detailed gift card info, handles status updates, tag editing, and shows NGN rate table.",
  "frontend/src/pages/giftcards/GiftCardsListPage.tsx": "Lists all gift cards with tag-based filtering and navigation to add or view details.",
  "frontend/src/pages/giftcards/HottestCardsPage.tsx": "Ranks and displays gift cards by best NGN rate with navigation to details or adding new cards.",
  "frontend/src/pages/giftcards/hottestCardsRanking.ts": "Ranks gift cards by highest NGN rate using rate tables with deterministic tiebreakers.",
  "frontend/src/pages/giftcards/SellGiftCardPage.tsx": "Allows selling a gift card by entering an amount, selecting vendors, and viewing conversion calculations.",
  "frontend/src/pages/HistoryPage.tsx": "Displays local transaction history, loading and updating from local storage and rendering rows or an empty state.",
  "frontend/src/pages/KycPage.tsx": "Allows users to submit KYC data with file upload and shows current verification status.",
  "frontend/src/pages/services/AirtimePage.tsx": "Provides a form to purchase airtime, log a local transaction, and handle basic input validation.",
  "frontend/src/pages/services/BettingPage.tsx": "Implements a two-step betting top-up form with provider selection, account ID, amount input, and confirmation, logging transactions locally.",
  "frontend/src/pages/services/BillsPage.tsx": "Displays bill payment categories and routes users to specific service pages via a grid of selectable tiles.",
  "frontend/src/pages/services/CableTvBillsPage.tsx": "Provides a placeholder cable TV bill payment form that logs a mock transaction and shows a ‘coming soon’ notice.",
  "frontend/src/pages/services/CryptoWalletPage.tsx": "Renders a crypto wallet dashboard with mock token data, quick actions, activity list, and multiple transaction sheets.",
  "frontend/src/pages/services/DataPage.tsx": "Offers a placeholder mobile data purchase form that logs mock transactions and displays a coming-soon alert.",
  "frontend/src/pages/services/ElectricityPage.tsx": "Contains a placeholder electricity bill payment form that logs mock transactions and includes a coming-soon notice.",
  "frontend/src/pages/services/WifiInternetPage.tsx": "React page for entering an account ID and amount to log a placeholder internet bill payment as a local transaction.",
  "frontend/src/pages/SettingsPage.tsx": "Provides user settings for authentication info and notification preferences using Internet Identity.",
  "frontend/src/pages/withdrawals/WithdrawalsPage.tsx": "Handles viewing withdrawal requests, adding payout methods, and submitting new withdrawals using multiple hooks and form inputs.",
  "frontend/src/state/localTransactions.ts": "Manages local transaction storage with functions to add, retrieve, and clear up to 50 stored transactions.",
  "frontend/src/state/notificationSettingsStorage.ts": "Provides getter and setter utilities for per‑principal notification settings stored in localStorage.",
  "frontend/src/types/app-types.ts": "Type definitions for app entities including users, wallets, transactions, gift cards, KYC records, payout methods, and withdrawals.",
  "frontend/src/types/process-env.d.ts": "TypeScript declarations for frontend environment variables injected by Vite.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugin usage.",
  "frontend/vite.config.ts": "Vite config enabling React, path aliases, env injection, chunk splitting, proxies, and build settings.",
  "project_state.json": "Defines the current project state, listing existing UI-related features for a redesigned login screen and one pending new feature request. Contains metadata like schema versions, project description, and empty notes/issue arrays."
}