{
  "backend/main.mo": "Motoko canister defining user profiles, payout methods, and withdrawal requests with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-like listing of frontend file summaries describing functionality across components, pages, hooks, and utilities.",
  "frontend/BUILD_DEPLOY_TROUBLESHOOTING.md": "Guide for building and deploying the app with steps for local and production environments plus required environment variables.",
  "frontend/docs/betting-topup-video-checklist.md": "Checklist documenting required UI, interactions, and validation for the betting top‑up flow implementation.",
  "frontend/docs/crypto-wallet-dashboard-checklist.md": "Checklist covering all UI sections and behaviors for the crypto wallet dashboard, including actions and state handling.",
  "frontend/index.css": "Tailwind CSS setup defining design tokens, theme variables, and dark mode styles.",
  "frontend/index.html": "Basic HTML entry point loading the frontend app via main.tsx.",
  "frontend/src/App.tsx": "Defines the app layout with authentication gating, profile-setup logic, and all TanStack Router route definitions.",
  "frontend/src/backend-augment.d.ts": "Augments the backend actor interface with an authorization initialization method for admin setup.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Provides an admin-only route wrapper that shows loading state or an access-denied message.",
  "frontend/src/components/auth/LoginCard.tsx": "Renders the login UI using Internet Identity with branding and status messaging.",
  "frontend/src/components/crypto/CryptoActivityRow.tsx": "Displays a single crypto transaction row with icons, status badge, and relative timestamp.",
  "frontend/src/components/crypto/CryptoActivitySection.tsx": "Loads and filters local crypto transactions, displaying them in a tabbed activity list with loading and empty states.",
  "frontend/src/components/crypto/CryptoDashboardHeader.tsx": "Shows the crypto dashboard balance header with a hide/show toggle and stylized background.",
  "frontend/src/components/crypto/CryptoQuickActions.tsx": "Renders quick‑action buttons for crypto operations such as send, receive, buy, swap, and bank transfer.",
  "frontend/src/components/crypto/CryptoTokenList.tsx": "Lists crypto tokens with icons, balances, and click handling for selection.",
  "frontend/src/components/crypto/sheets/BuyCryptoSheet.tsx": "UI sheet for selecting a crypto asset and USD amount to create a pending local 'buy' transaction.",
  "frontend/src/components/crypto/sheets/ReceiveCryptoSheet.tsx": "Sheet for selecting an asset, displaying a mock receive address, copying it, and logging a placeholder received transaction.",
  "frontend/src/components/crypto/sheets/SendCryptoSheet.tsx": "Form for choosing an asset, destination address, and amount to create a pending local 'send' crypto transaction.",
  "frontend/src/components/crypto/sheets/SendToBankSheet.tsx": "Multi-step flow for entering withdrawal amount, selecting or adding payout methods, and submitting a withdrawal request.",
  "frontend/src/components/crypto/sheets/SwapCryptoSheet.tsx": "Sheet for swapping between two crypto assets with mock rate calculation and creation of a pending swap transaction.",
  "frontend/src/components/dashboard/DashboardPromoCard.tsx": "Promotional dashboard card with illustration, text, and pagination dots.",
  "frontend/src/components/dashboard/DashboardShortcutTile.tsx": "Configurable dashboard shortcut button with icon, label, optional badge, and coming-soon state.",
  "frontend/src/components/giftcards/GiftCardBrandRow.tsx": "No summary available.",
  "frontend/src/components/giftcards/GiftCardLabelsChips.tsx": "Renders up to a limit of label badges and a count badge for remaining tags.",
  "frontend/src/components/giftcards/GiftCardLabelsEditor.tsx": "Editor for adding, removing, and saving gift card label tags with UI controls and save state.",
  "frontend/src/components/giftcards/GiftCardLabelsFilterBar.tsx": "Filter bar allowing selection and clearing of gift card labels via popover and badges.",
  "frontend/src/components/giftcards/GiftCardRateTable.tsx": "Displays NGN rate tiers for a gift card brand in a table format.",
  "frontend/src/components/giftcards/NGNRateInlineSummary.tsx": "Inline summary showing matched NGN rate tier or an unavailable notice.",
  "frontend/src/components/giftcards/SelectGiftCardCategoryPicker.tsx": "Bottom sheet allowing users to search and select a gift card brand using filter and list UI.",
  "frontend/src/components/history/HistoryTransactionRow.tsx": "Row component showing transaction icon, details, relative time, amount, and status badge.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with sidebar, mobile header, navigation, and logout handling.",
  "frontend/src/components/layout/MobileBottomNavDock.tsx": "Mobile bottom navigation dock for quick navigation between key app routes.",
  "frontend/src/components/payout/NigerianBankSelect.tsx": "Searchable dropdown component for selecting Nigerian banks using Command and Popover UI.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal for creating a user profile with name input and backend submission.",
  "frontend/src/components/services/BillCategoryTile.tsx": "Clickable UI card representing a bill payment category with an icon and label.",
  "frontend/src/config/betting.ts": "Defines supported betting providers and preset amount chip values.",
  "frontend/src/config/finance.ts": "Provides conversion rate config and a function to compute gross, fee, and net amounts.",
  "frontend/src/config/giftCardBrandCatalog.ts": "Catalog of gift card brands with names, search terms, icons, and helper filtering.",
  "frontend/src/config/giftCardRatesNGN.ts": "Defines NGN rate tables, brand overrides, and helpers for matching tiers and formatting rates.",
  "frontend/src/config/nigerianBanks.ts": "Exports a list of Nigerian banks and a search filter function.",
  "frontend/src/config/vendors.ts": "Lists payout vendors and selects the best one based on net payout calculation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on user identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Re-exports hook for fetching the caller's user profile.",
  "frontend/src/hooks/useDashboardData.ts": "Aggregates profile, KYC, cards, withdrawals, and transactions into a unified dashboard dataset.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useNotificationPermission.ts": "Offers a hook to check browser notification support, read permission state, and request permission safely.",
  "frontend/src/hooks/useNotificationSettings.ts": "Manages per‑principal notification preferences with localStorage persistence and a toggle API.",
  "frontend/src/hooks/useProfileSetupSuppression.ts": "Handles storing and retrieving per‑principal suppression flags for hiding the profile setup prompt.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile and gift card operations, including backend mapping and mutations.",
  "frontend/src/hooks/useWalletSummary.ts": "Fetches the caller’s user profile and returns primary wallet balance and currency.",
  "frontend/src/index.css": "Tailwind CSS setup defining design tokens, themes, and utility classes for the app.",
  "frontend/src/lib/utils.ts": "Utility functions including class merging, currency formatting, and date formatting.",
  "frontend/src/main.tsx": "App entry point that initializes React, React Query, and the Internet Identity provider.",
  "frontend/src/pages/admin/AdminKycReviewPage.tsx": "Admin interface to search users, view their KYC records, and update KYC statuses.",
  "frontend/src/pages/admin/AdminWithdrawalsPage.tsx": "Admin interface for reviewing and approving or rejecting pending withdrawal requests.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the dashboard with balance visibility toggle, shortcuts, and styled header using dashboard data.",
  "frontend/src/pages/giftcards/__tests__/addGiftCardNGNRateSummary.test.tsx": "Empty test file placeholder for NGN rate summary behavior.",
  "frontend/src/pages/giftcards/addGiftCardNGNRate.ts": "Utility to compute the NGN rate tier for a given brand and amount string.",
  "frontend/src/pages/giftcards/AddGiftCardPage.tsx": "Form to add a gift card with brand selection, currency, amount, code, optional image upload, and NGN rate tier computation.",
  "frontend/src/pages/giftcards/GiftCardDetailPage.tsx": "Displays details for a single gift card, including status updates, labels, and NGN rate tables.",
  "frontend/src/pages/giftcards/GiftCardsListPage.tsx": "Lists all gift cards with tag-based filtering and navigation to add or view cards.",
  "frontend/src/pages/giftcards/HottestCardsPage.tsx": "Ranks and displays gift cards by highest NGN rates with navigation to details or add page.",
  "frontend/src/pages/giftcards/hottestCardsRanking.ts": "Computes and sorts gift cards by their highest NGN rate using deterministic tie-breakers.",
  "frontend/src/pages/giftcards/SellGiftCardPage.tsx": "Handles selling a gift card by computing rates, selecting vendors, and validating amount and card status.",
  "frontend/src/pages/HistoryPage.tsx": "Displays local transaction history, listens for new transactions, and shows a list or empty state with navigation.",
  "frontend/src/pages/KycPage.tsx": "Shows current KYC status and provides a form to submit identity documents with file upload and progress tracking.",
  "frontend/src/pages/services/AirtimePage.tsx": "Form page to purchase airtime by selecting a provider, entering phone and amount, and logging a local transaction.",
  "frontend/src/pages/services/BettingPage.tsx": "Implements a betting top‑up form with provider selection, account ID, amount entry, and a review/confirm flow that logs a local transaction.",
  "frontend/src/pages/services/BillsPage.tsx": "Shows a grid of bill‑payment categories and navigates to the corresponding service pages.",
  "frontend/src/pages/services/CableTvBillsPage.tsx": "Provides a placeholder Cable TV payment form that logs a mock transaction for a smartcard number and amount.",
  "frontend/src/pages/services/CryptoWalletPage.tsx": "Displays a crypto wallet dashboard with mock token balances, quick action sheets, and activity sections.",
  "frontend/src/pages/services/DataPage.tsx": "Contains a placeholder mobile data purchase form that logs a mock transaction for a phone number and amount.",
  "frontend/src/pages/services/ElectricityPage.tsx": "Offers a placeholder electricity bill payment form that logs a mock transaction for meter number and amount.",
  "frontend/src/pages/services/WifiInternetPage.tsx": "React page for submitting placeholder internet bill payments and logging them locally as pending transactions.",
  "frontend/src/pages/SettingsPage.tsx": "Provides user settings for authentication info and notification preferences using Internet Identity and browser permissions.",
  "frontend/src/pages/withdrawals/WithdrawalsPage.tsx": "UI for viewing withdrawal requests, adding payout methods, and submitting new withdrawal requests with currency selection.",
  "frontend/src/state/localTransactions.ts": "Manages local transaction storage in localStorage, allowing add, retrieve, and clear operations with auto‑generated IDs.",
  "frontend/src/state/notificationSettingsStorage.ts": "Handles per‑principal notification settings using scoped localStorage keys for reading and writing flags.",
  "frontend/src/types/app-types.ts": "Defines TypeScript types for currencies, profiles, wallets, transactions, gift cards, KYC records, payouts, and withdrawals.",
  "frontend/src/types/process-env.d.ts": "Declares TypeScript types for frontend environment variables like II_URL and II_DERIVATION_ORIGIN.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from hashes.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, plugins, and container settings.",
  "frontend/vite.config.ts": "Vite config enabling React, environment variable injection, aliases, build chunking, dev server proxying, and dependency optimization.",
  "project_state.json": "Defines project state for adding full Nigerian bank support, listing existing features, a new request, and notes on updating withdrawal UI with a maintained bank list."
}