{
  "backend/main.mo": "Defines the backend canister with types and state for KYC records, payout methods, withdrawals, gift card rates, and related CRUD; includes authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report linking a KYC‑gated withdrawals UI change to specific frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend source files covering utilities, pages, components, hooks, and configuration entries.",
  "frontend/BUILD_DEPLOY_TROUBLESHOOTING.md": "Guide describing build and deployment steps for local and production environments, including required tools and environment variables.",
  "frontend/docs/betting-topup-video-checklist.md": "Checklist documenting all UI steps, states, and validations for implementing the betting top‑up flow.",
  "frontend/docs/crypto-wallet-dashboard-checklist.md": "Checklist outlining required UI sections, components, and states for the crypto wallet dashboard implementation.",
  "frontend/index.css": "Tailwind base stylesheet defining global CSS variables, light/dark theme tokens, and applying layout defaults.",
  "frontend/index.html": "Minimal HTML entry point mounting the frontend app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Defines routing and authentication flow, rendering login, registration, error, or main app shell based on Internet Identity and user profile states.",
  "frontend/src/backend-augment.d.ts": "Extends the backend actor TypeScript types to include access control initialization and user role assignment methods.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Guards admin-only routes by checking admin status and showing loading or access-denied UI when appropriate.",
  "frontend/src/components/admin/CoinPriceIndexCard.tsx": "Displays and updates a global coin price index with input validation, change indicators, and mutation handling.",
  "frontend/src/components/auth/AuthInitializingScreen.tsx": "Shows a full‑screen loading indicator while Internet Identity authentication initializes.",
  "frontend/src/components/auth/LoginCard.tsx": "Provides the login UI using Internet Identity with error handling, signup trigger, and informational dialogs.",
  "frontend/src/components/crypto/CryptoActivityRow.tsx": "Renders a single crypto transaction row with icon, timestamp formatting, amount, and status badge.",
  "frontend/src/components/crypto/CryptoActivitySection.tsx": "Loads, filters, and displays crypto transactions with tabs, skeletons, and real‑time local storage updates.",
  "frontend/src/components/crypto/CryptoDashboardHeader.tsx": "Shows a styled crypto dashboard header with total balance and a visibility toggle.",
  "frontend/src/components/crypto/CryptoQuickActions.tsx": "Renders a horizontal list of crypto action buttons (send, receive, buy, swap, send to bank) with icons and callbacks. Provides quick navigation triggers for various crypto operations.",
  "frontend/src/components/crypto/CryptoTokenList.tsx": "Displays a list of crypto tokens with icon, name, ticker, balance, and USD value. Allows optional click handling for selecting a token.",
  "frontend/src/components/crypto/sheets/BuyCryptoSheet.tsx": "Bottom sheet for buying crypto that lets users pick an asset, enter an amount, and logs a local pending transaction. Handles validation, loading state, and resets on close.",
  "frontend/src/components/crypto/sheets/ReceiveCryptoSheet.tsx": "Bottom sheet for selecting a crypto asset and showing a mock receive address with copy-to-clipboard support. Logs a placeholder received transaction when the address is copied.",
  "frontend/src/components/crypto/sheets/SendCryptoSheet.tsx": "Bottom sheet for sending crypto, allowing users to choose an asset, input an address and amount, and create a pending local transaction. Manages form validation and processing state.",
  "frontend/src/components/crypto/sheets/SendToBankSheet.tsx": "Multi-step bottom sheet for withdrawing funds to a bank account, including amount entry, payout method selection or creation, and review. Integrates payout method APIs and withdrawal submission.",
  "frontend/src/components/crypto/sheets/SwapCryptoSheet.tsx": "Bottom sheet for swapping one crypto asset to another with mock rate calculation, reverse-swap UI, and local transaction logging. Validates inputs and manages processing state.",
  "frontend/src/components/dashboard/DashboardPromoCard.tsx": "Displays a promotional dashboard card with text, an illustration, and dot indicators, including a gradient fallback for image errors.",
  "frontend/src/components/dashboard/DashboardShortcutTile.tsx": "Renders a clickable or disabled dashboard shortcut tile with an icon, optional badge, and size variations.",
  "frontend/src/components/giftcards/GiftCardBrandRow.tsx": "Shows a selectable gift card brand row with icon fallback and brand name.",
  "frontend/src/components/giftcards/GiftCardLabelsChips.tsx": "Displays label chips with an optional counter for remaining hidden tags.",
  "frontend/src/components/giftcards/GiftCardLabelsEditor.tsx": "Provides UI to add, remove, and save gift card labels, showing changes and save state.",
  "frontend/src/components/giftcards/GiftCardLabelsFilterBar.tsx": "Offers a popover-based filter bar for selecting and clearing gift card label filters.",
  "frontend/src/components/giftcards/GiftCardRateTable.tsx": "Shows a card with NGN rate tiers for a gift card brand in a table format.",
  "frontend/src/components/giftcards/NGNRateInlineSummary.tsx": "Displays an inline summary of matched NGN rates or an unavailable notice.",
  "frontend/src/components/giftcards/SelectGiftCardCategoryPicker.tsx": "Implements a bottom sheet with search for selecting a gift card brand.",
  "frontend/src/components/history/HistoryTransactionRow.tsx": "Renders a transaction row with icon, timestamp, amount formatting, and status badge.",
  "frontend/src/components/kyc/DocumentSignatureOverlay.tsx": "Canvas-based component for loading an image and capturing signature strokes, notifying parent of signature state and enabling signature export.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout providing desktop sidebar, mobile header, navigation handling, and logout controls.",
  "frontend/src/components/layout/MobileBottomNavDock.tsx": "Mobile bottom navigation bar showing key routes with icons and active-state highlighting.",
  "frontend/src/components/payout/NigerianBankSelect.tsx": "Searchable dropdown for selecting Nigerian banks using popover and command components.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal prompting users to enter their name and create a profile via a mutation hook.",
  "frontend/src/components/services/BillCategoryTile.tsx": "Clickable card tile showing a service category icon and label for bill-related actions.",
  "frontend/src/config/__tests__/nigerianBanks.test.ts": "Empty test file placeholder for Nigerian banks configuration.",
  "frontend/src/config/betting.ts": "Defines betting providers list and preset amount chip values.",
  "frontend/src/config/finance.ts": "Provides conversion config and a helper to compute gross, fee, and net values with optional overrides.",
  "frontend/src/config/giftCardBrandCatalog.ts": "Catalog of gift card brands with icons and search terms plus a brand filtering helper.",
  "frontend/src/config/giftCardRatesNGN.ts": "Defines NGN gift card rate tiers and helpers to match amounts, format labels, and retrieve brand-specific rate tables.",
  "frontend/src/config/nigerianBanks.ts": "Provides a list of Nigerian banks and a search function that normalizes text for forgiving matching.",
  "frontend/src/config/vendors.ts": "Defines vendors with rates and fees and includes logic to compute payouts and select the best vendor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Re-exports the caller user profile query hook.",
  "frontend/src/hooks/useDashboardData.ts": "Aggregates profile, KYC, cards, withdrawals, tags, and transactions into a unified dashboard data object.",
  "frontend/src/hooks/useEnsureUserRegistered.ts": "Ensures an authenticated user is registered by checking and assigning roles with retry and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and AuthClient setup.",
  "frontend/src/hooks/useNotificationPermission.ts": "Checks browser notification support, tracks permission state, and provides a safe requestPermission method.",
  "frontend/src/hooks/useNotificationSettings.ts": "Manages per‑principal notification preference stored in localStorage with toggle support.",
  "frontend/src/hooks/useProfileSetupSuppression.ts": "Tracks and updates per‑principal suppression of profile setup prompts using localStorage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks and mapping helpers for user profiles, KYC, payouts, withdrawal statuses, and document types between frontend and backend.",
  "frontend/src/hooks/useSellGiftCardQuote.ts": "Provides hooks to fetch sell quotes for gift cards and calculate payouts by interacting with backend rate and payout APIs.",
  "frontend/src/hooks/useWalletSummary.ts": "Extracts wallet balance and currency from the current user profile for display in wallet UI components.",
  "frontend/src/index.css": "Configures Tailwind base styles, color variables, dark mode theme, and utility classes including safe-area padding.",
  "frontend/src/lib/utils.ts": "Contains utility functions for class merging, formatting currency, and formatting dates for UI usage.",
  "frontend/src/main.tsx": "Initializes the React app, setting up React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/pages/admin/AdminGiftCardRatesPage.tsx": "Provides admin UI to view, create, edit, and activate/deactivate gift card exchange rates with coin index integration.",
  "frontend/src/pages/admin/AdminKycReviewPage.tsx": "Allows admins to search users, review KYC submissions, and update verification status with document viewing.",
  "frontend/src/pages/admin/AdminWithdrawalsPage.tsx": "Displays pending withdrawal requests for admins to approve or reject with status updates.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard with balance display, shortcuts, and loading states using dashboard data and formatting helpers.",
  "frontend/src/pages/giftcards/__tests__/addGiftCardNGNRateSummary.test.tsx": "Empty test file placeholder for NGN rate summary tests.",
  "frontend/src/pages/giftcards/addGiftCardNGNRate.ts": "Provides helper to compute the NGN rate tier for a brand and amount using the rate table and tier matching.",
  "frontend/src/pages/giftcards/AddGiftCardPage.tsx": "Form for users to add a gift card with brand selection, currency, amount, code, image upload, and NGN rate preview.",
  "frontend/src/pages/giftcards/GiftCardDetailPage.tsx": "Displays details for a single gift card, including image, status, amount, metadata, and brand rate tables, with actions to update status.",
  "frontend/src/pages/giftcards/GiftCardsListPage.tsx": "Lists all gift cards with filtering by tags, loading states, and navigation to add or view individual cards.",
  "frontend/src/pages/giftcards/HottestCardsPage.tsx": "Ranks and displays gift cards by best NGN rate using a computed ranking, with loading and empty states.",
  "frontend/src/pages/giftcards/hottestCardsRanking.ts": "Computes and sorts gift cards by best NGN rate with deterministic tiebreakers and rate extraction logic.",
  "frontend/src/pages/giftcards/SellGiftCardPage.tsx": "Allows selling a gift card by fetching a quote, calculating payout, validating amount, and handling errors and loading states.",
  "frontend/src/pages/HistoryPage.tsx": "Displays local transaction history with live updates and navigation, falling back to an empty state when no entries exist.",
  "frontend/src/pages/KycPage.tsx": "Implements the KYC submission flow with document upload, optional signature capture, progress tracking, and status display.",
  "frontend/src/pages/services/AirtimePage.tsx": "Implements airtime purchase form with provider selection, phone input, amount chips, validation, and local transaction logging.",
  "frontend/src/pages/services/BettingPage.tsx": "A two-step betting top-up form allowing users to enter provider, account ID, and amount, then review and confirm, logging the transaction locally.",
  "frontend/src/pages/services/BillsPage.tsx": "Displays a grid of bill‑payment categories with navigation links for airtime, data, electricity, internet, cable TV, and betting.",
  "frontend/src/pages/services/CableTvBillsPage.tsx": "Placeholder cable TV payment form that collects smartcard number and amount, then logs a local transaction.",
  "frontend/src/pages/services/CryptoWalletPage.tsx": "Crypto wallet dashboard showing mock token balances, activity, and sheets for sending, receiving, buying, swapping, and cashing out crypto.",
  "frontend/src/pages/services/DataPage.tsx": "Placeholder mobile data purchase form that collects phone number and amount, then logs the transaction locally.",
  "frontend/src/pages/services/ElectricityPage.tsx": "Placeholder electricity bill payment form that accepts meter number and amount, recording a local transaction.",
  "frontend/src/pages/services/WifiInternetPage.tsx": "React page for submitting placeholder internet bill payments and logging them as local transactions.",
  "frontend/src/pages/SettingsPage.tsx": "Renders user settings including Internet Identity info and notification preferences with permission handling.",
  "frontend/src/pages/withdrawals/WithdrawalsPage.tsx": "Page for managing withdrawals, including requesting withdrawals, adding payout methods, and viewing withdrawal status.",
  "frontend/src/state/localTransactions.ts": "LocalStorage-backed utility for adding, retrieving, and clearing lightweight local transaction records.",
  "frontend/src/state/notificationSettingsStorage.ts": "Provides per‑principal notification setting storage using localStorage with safe read/write helpers.",
  "frontend/src/types/app-types.ts": "Type definitions for currencies, users, wallets, transactions, gift cards, KYC, payout methods, and withdrawals.",
  "frontend/src/types/process-env.d.ts": "Type declarations for process.env variables used by the frontend and injected by Vite.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and enabling plugins.",
  "frontend/vite.config.ts": "Vite config defining plugins, aliases, env shims, build settings, dev server, and dependency optimization.",
  "project_state.json": "Defines project state for implementing KYC-gated withdrawals, including existing and pending feature requests enforcing KYC checks on UI and backend."
}