{
  "backend/main.mo": "Motoko backend defining user profiles, KYC records, payout methods, and withdrawal requests with admin/user authorization and CRUD-style KYC operations.",
  "feature_evidence.json": "Feature evidence report describing work related to expanding Nigerian bank options and listing affected files and components.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing the purpose of various frontend files including utilities, pages, hooks, and components.",
  "frontend/BUILD_DEPLOY_TROUBLESHOOTING.md": "Guide outlining build and deployment steps for local and production environments, including required environment variables.",
  "frontend/docs/betting-topup-video-checklist.md": "Checklist documenting required UI screens, states, validations, and behavior for the betting top‑up flow implementation.",
  "frontend/docs/crypto-wallet-dashboard-checklist.md": "Checklist detailing UI components, actions, modals, and state handling required for the crypto wallet dashboard.",
  "frontend/index.css": "Tailwind CSS base file defining design tokens and theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point bootstrapping the frontend app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up routing and renders authentication, registration, and app layout logic based on Internet Identity state.",
  "frontend/src/backend-augment.d.ts": "Augments the backend actor interface with access-control initialization and role assignment methods.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Protects admin-only routes by checking admin status and showing loading or access-denied UI.",
  "frontend/src/components/auth/AuthInitializingScreen.tsx": "Displays a full‑screen loading screen while Internet Identity initializes.",
  "frontend/src/components/auth/LoginCard.tsx": "Provides the login UI using Internet Identity with error handling, sign‑up flow, and informational dialogs.",
  "frontend/src/components/crypto/CryptoActivityRow.tsx": "Renders a single crypto transaction row with icon, timestamp, amount, and status badge.",
  "frontend/src/components/crypto/CryptoActivitySection.tsx": "Loads and filters local crypto transactions, displaying them with tabs and skeleton states.",
  "frontend/src/components/crypto/CryptoDashboardHeader.tsx": "Shows crypto wallet header with balance display and visibility toggle.",
  "frontend/src/components/crypto/CryptoQuickActions.tsx": "Renders quick‑action buttons for common crypto actions like send, receive, buy, swap, and withdraw.",
  "frontend/src/components/crypto/CryptoTokenList.tsx": "Lists crypto tokens with balances and click handling, using a card layout.",
  "frontend/src/components/crypto/sheets/BuyCryptoSheet.tsx": "Bottom sheet UI for selecting a crypto asset and amount to buy, then adding a pending local transaction.",
  "frontend/src/components/crypto/sheets/ReceiveCryptoSheet.tsx": "Displays a selectable asset, mock receive address, and copy-to-clipboard flow that logs a placeholder received transaction.",
  "frontend/src/components/crypto/sheets/SendCryptoSheet.tsx": "Form to send crypto by selecting an asset, entering address and amount, then creating a pending local transaction.",
  "frontend/src/components/crypto/sheets/SendToBankSheet.tsx": "Multi-step withdrawal sheet handling amount entry, payout method selection or creation, and submission of a withdrawal request.",
  "frontend/src/components/crypto/sheets/SwapCryptoSheet.tsx": "Allows swapping between two crypto assets with mock rate calculation and logs a swap transaction.",
  "frontend/src/components/dashboard/DashboardPromoCard.tsx": "Static promo card showing a global connectivity message with illustration and pagination dots.",
  "frontend/src/components/dashboard/DashboardShortcutTile.tsx": "Configurable dashboard shortcut tile with icon, label, optional badge, and disabled or clickable states.",
  "frontend/src/components/giftcards/GiftCardBrandRow.tsx": "Renders a clickable brand row with icon fallback and name display.",
  "frontend/src/components/giftcards/GiftCardLabelsChips.tsx": "Shows up to a limited number of label chips with a counter for remaining tags.",
  "frontend/src/components/giftcards/GiftCardLabelsEditor.tsx": "Provides UI to add, remove, and save editable gift card labels with change detection.",
  "frontend/src/components/giftcards/GiftCardLabelsFilterBar.tsx": "Offers a popover-based filter UI for selecting and clearing label tags.",
  "frontend/src/components/giftcards/GiftCardRateTable.tsx": "Displays NGN rate tiers for a gift card brand in a table format.",
  "frontend/src/components/giftcards/NGNRateInlineSummary.tsx": "Shows an inline NGN rate summary or an unavailable notice based on tier matching.",
  "frontend/src/components/giftcards/SelectGiftCardCategoryPicker.tsx": "Bottom sheet listing gift card brands with search filtering and selection handling.",
  "frontend/src/components/history/HistoryTransactionRow.tsx": "Renders a transaction row with icon, timestamp, amount formatting, and status badge.",
  "frontend/src/components/kyc/DocumentSignatureOverlay.tsx": "Canvas overlay that loads a document image and captures signature strokes for export.",
  "frontend/src/components/layout/AppShell.tsx": "Layout component providing desktop sidebar and mobile header/navigation with route links and logout handling.",
  "frontend/src/components/layout/MobileBottomNavDock.tsx": "Mobile bottom navigation bar component that renders route shortcuts and highlights the active route.",
  "frontend/src/components/payout/NigerianBankSelect.tsx": "Searchable dropdown component for selecting Nigerian banks using a popover and command list.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal for creating a user profile with a name field, submit handling, and loading/error states.",
  "frontend/src/components/services/BillCategoryTile.tsx": "Clickable tile component displaying a bill category label and icon for service selection.",
  "frontend/src/config/__tests__/nigerianBanks.test.ts": "Empty test file placeholder for Nigerian banks configuration tests.",
  "frontend/src/config/betting.ts": "Defines available betting providers and preset chip amounts for betting services.",
  "frontend/src/config/finance.ts": "Provides conversion rate config and a utility to calculate gross, fee, and net values with optional overrides.",
  "frontend/src/config/giftCardBrandCatalog.ts": "Catalog of gift card brands with names, search terms, and icon paths plus a brand filtering helper.",
  "frontend/src/config/giftCardRatesNGN.ts": "Defines NGN gift card rate tables, brand overrides, and utilities to match amounts to tiers and format rates.",
  "frontend/src/config/nigerianBanks.ts": "Lists Nigerian banks and includes utilities for normalizing names and filtering banks by search query.",
  "frontend/src/config/vendors.ts": "Defines vendor data and contains helper functions to compute net payouts and select the best vendor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Re-exports the user profile query hook.",
  "frontend/src/hooks/useDashboardData.ts": "Aggregates profile, KYC, cards, withdrawals, tags, and recent transactions into a unified dashboard dataset.",
  "frontend/src/hooks/useEnsureUserRegistered.ts": "Ensures the authenticated user is registered in backend access control, handling self-registration and retries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, identity management, and context for authentication.",
  "frontend/src/hooks/useNotificationPermission.ts": "Tracks browser notification permission and exposes a safe permission request method.",
  "frontend/src/hooks/useNotificationSettings.ts": "Manages per‑principal local preference for in‑app notifications with persistence.",
  "frontend/src/hooks/useProfileSetupSuppression.ts": "Stores and retrieves per‑principal suppression state for dismissing the profile setup prompt.",
  "frontend/src/hooks/useQueries.ts": "Defines data-fetching hooks and backend-to-frontend type mappers for profiles, KYC, withdrawals, and documents.",
  "frontend/src/hooks/useWalletSummary.ts": "Returns the user’s primary wallet balance and currency from their profile.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables plus a safe-area padding utility.",
  "frontend/src/lib/utils.ts": "Provides class name merging, currency formatting for multiple types, and timestamp-to-date formatting.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminKycReviewPage.tsx": "Admin interface to search users by principal, view their KYC submissions, and approve or reject individual records.",
  "frontend/src/pages/admin/AdminWithdrawalsPage.tsx": "Displays pending withdrawal requests and allows admins to approve or reject them with status updates.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard with balance display, shortcuts, and loading states using dashboard data.",
  "frontend/src/pages/giftcards/__tests__/addGiftCardNGNRateSummary.test.tsx": "Empty test file placeholder for NGN rate summary logic.",
  "frontend/src/pages/giftcards/addGiftCardNGNRate.ts": "Exports helper to compute the matched NGN rate tier for a brand and amount after validating input.",
  "frontend/src/pages/giftcards/AddGiftCardPage.tsx": "Form for admins to add new gift cards including brand, currency, amount, code, and optional image upload.",
  "frontend/src/pages/giftcards/GiftCardDetailPage.tsx": "Shows detailed gift card info, allows updating status, editing labels, and viewing applicable NGN rate tables.",
  "frontend/src/pages/giftcards/GiftCardsListPage.tsx": "Lists all gift cards with filtering by labels and navigation to add or view individual cards.",
  "frontend/src/pages/giftcards/HottestCardsPage.tsx": "Displays ranked gift cards by NGN rate, showing loading skeletons and top-three badges, with navigation to add or view cards.",
  "frontend/src/pages/giftcards/hottestCardsRanking.ts": "Computes best NGN rate per gift card and sorts cards by rate with deterministic tiebreakers.",
  "frontend/src/pages/giftcards/SellGiftCardPage.tsx": "Provides a form to sell a gift card by selecting amount, vendor, and computing conversion details, with handling for loading and invalid states.",
  "frontend/src/pages/HistoryPage.tsx": "Displays local transaction history with automatic updates and navigation controls.",
  "frontend/src/pages/KycPage.tsx": "Handles KYC submission with file upload, signature support, validation, and status display.",
  "frontend/src/pages/services/AirtimePage.tsx": "Implements airtime purchase form with provider, phone, and amount selection, logging transactions locally.",
  "frontend/src/pages/services/BettingPage.tsx": "Handles betting top‑up flow with details and review steps, then logs a local transaction.",
  "frontend/src/pages/services/BillsPage.tsx": "Shows a grid of bill‑payment categories and navigates to their respective service pages.",
  "frontend/src/pages/services/CableTvBillsPage.tsx": "Page for submitting placeholder cable TV bill payments, capturing smartcard number and amount and logging a local transaction.",
  "frontend/src/pages/services/CryptoWalletPage.tsx": "Crypto wallet dashboard showing mock token balances, recent activity, and action sheets for send, receive, buy, swap, and bank transfer.",
  "frontend/src/pages/services/DataPage.tsx": "Page for buying mobile data with placeholder functionality, submitting phone number and amount to log a local transaction.",
  "frontend/src/pages/services/ElectricityPage.tsx": "Page for placeholder electricity bill payments, taking meter number and amount and saving a local transaction.",
  "frontend/src/pages/services/WifiInternetPage.tsx": "Page for submitting placeholder internet bill payments using an account ID and amount, logging the action locally.",
  "frontend/src/pages/SettingsPage.tsx": "Shows settings for authentication info and notification preferences using Internet Identity.",
  "frontend/src/pages/withdrawals/WithdrawalsPage.tsx": "Withdrawal management page with tabs for requesting withdrawals, adding payout methods, and listing withdrawal history using query hooks.",
  "frontend/src/state/localTransactions.ts": "Utility for storing, retrieving, and clearing up to 50 local transactions in localStorage, generating IDs and timestamps automatically.",
  "frontend/src/state/notificationSettingsStorage.ts": "Utility for generating scoped localStorage keys and getting/setting per‑principal notification preferences.",
  "frontend/src/types/app-types.ts": "Collection of TypeScript types for currencies, user profiles, wallets, transactions, gift cards, KYC records, payouts, and withdrawals.",
  "frontend/src/types/process-env.d.ts": "Type declarations for frontend environment variables II_URL and II_DERIVATION_ORIGIN.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, storing them in sessionStorage, and managing hash-based param cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, animations, and plugins like typography, container queries, and animate.",
  "frontend/vite.config.ts": "Vite config enabling React, env loading, path aliasing, env shims, chunk splitting, dev proxying, and global defines.",
  "project_state.json": "Metadata file describing project state, feature list, and pending requests for adding Nigerian digital banks."
}