{
  "backend/main.mo": "Motoko backend actor managing user profiles, payout methods, and withdrawal requests with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report listing features, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose and behavior of various frontend source files.",
  "frontend/BUILD_DEPLOY_TROUBLESHOOTING.md": "Guide covering build, deploy steps, environment variables, and troubleshooting for frontend and canisters.",
  "frontend/docs/betting-topup-video-checklist.md": "Checklist documenting required UI elements and interactions for the betting top-up flow.",
  "frontend/docs/crypto-wallet-dashboard-checklist.md": "Checklist of required UI components and states for the crypto wallet dashboard implementation.",
  "frontend/index.css": "Global Tailwind CSS file defining design tokens, color variables, and dark mode styles.",
  "frontend/index.html": "Base HTML file loading the frontend root element and main application script.",
  "frontend/src/App.tsx": "Configures the app’s root layout, authentication gate, profile-setup modal logic, and all TanStack Router routes for pages including dashboard, KYC, gift cards, withdrawals, and services.",
  "frontend/src/backend-augment.d.ts": "Extends the generated backend actor interface to include the admin initialization method _initializeAccessControlWithSecret.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Checks if the caller is an admin and either renders protected children, a loading skeleton, or an access-denied message.",
  "frontend/src/components/auth/LoginCard.tsx": "Displays the login UI using Internet Identity with a branded card, loading state, and informational alerts.",
  "frontend/src/components/crypto/CryptoActivityRow.tsx": "Renders a single crypto transaction row with icons, status badge, formatted timestamp, and amount display.",
  "frontend/src/components/crypto/CryptoActivitySection.tsx": "Loads and filters local crypto transactions, updating in real time and displaying them with tabs and skeleton states.",
  "frontend/src/components/crypto/CryptoDashboardHeader.tsx": "Shows a styled crypto balance header with background visuals and a toggle to hide or show the balance.",
  "frontend/src/components/crypto/CryptoQuickActions.tsx": "Renders a horizontal list of crypto action buttons such as send, receive, buy, swap, and send to bank.",
  "frontend/src/components/crypto/CryptoTokenList.tsx": "Lists crypto tokens with icons, balances, and values, allowing optional click handling for each asset.",
  "frontend/src/components/crypto/sheets/BuyCryptoSheet.tsx": "UI sheet for selecting a crypto asset and USD amount to buy, creating a pending local transaction after validation.",
  "frontend/src/components/crypto/sheets/ReceiveCryptoSheet.tsx": "UI sheet for selecting a crypto asset and copying a mock receive address, logging a placeholder received transaction.",
  "frontend/src/components/crypto/sheets/SendCryptoSheet.tsx": "UI sheet for sending crypto by selecting an asset, entering an address and amount, and creating a pending sent transaction.",
  "frontend/src/components/crypto/sheets/SendToBankSheet.tsx": "Multi‑step UI flow for withdrawing funds to a bank account, including payout method selection and submission of withdrawal requests.",
  "frontend/src/components/crypto/sheets/SwapCryptoSheet.tsx": "UI sheet for swapping between two crypto assets with mock rate calculation and logging a swap transaction.",
  "frontend/src/components/dashboard/DashboardPromoCard.tsx": "Promo card displaying a global connectivity message with an illustration and pagination dots.",
  "frontend/src/components/dashboard/DashboardShortcutTile.tsx": "Configurable dashboard shortcut tile with icon, label, optional badge, and disabled state for coming-soon items.",
  "frontend/src/components/giftcards/GiftCardBrandRow.tsx": "Displays a clickable gift card brand row with an icon and name, falling back to a generic icon on load errors.",
  "frontend/src/components/giftcards/GiftCardLabelsChips.tsx": "Renders a small set of label badges with an optional counter for remaining tags.",
  "frontend/src/components/giftcards/GiftCardLabelsEditor.tsx": "Provides UI to add, remove, and save editable gift card labels with change detection and save handling.",
  "frontend/src/components/giftcards/GiftCardLabelsFilterBar.tsx": "Allows filtering by available labels through a popover with searchable tags and displays selected filters.",
  "frontend/src/components/giftcards/GiftCardRateTable.tsx": "Shows a card listing NGN rate tiers for a gift card brand using formatted amounts and rates.",
  "frontend/src/components/giftcards/NGNRateInlineSummary.tsx": "Displays a brief NGN rate summary for a matched tier or an unavailable notice when applicable.",
  "frontend/src/components/giftcards/SelectGiftCardCategoryPicker.tsx": "Bottom sheet selector for browsing and searching gift card brands and choosing one.",
  "frontend/src/components/history/HistoryTransactionRow.tsx": "Renders a transaction row with icon, timestamp, amount, and status styling based on transaction properties.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing desktop sidebar, mobile header, navigation, and logout handling for the app.",
  "frontend/src/components/layout/MobileBottomNavDock.tsx": "Provides a mobile bottom navigation bar with icons and route navigation highlighting.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal for creating a user profile with name input and async profile creation handling.",
  "frontend/src/components/services/BillCategoryTile.tsx": "Clickable card component showing a bill category icon and label with keyboard support.",
  "frontend/src/config/betting.ts": "Defines betting providers list and preset amount chip values.",
  "frontend/src/config/finance.ts": "Provides conversion rate config and a function to calculate gross, fee, and net values.",
  "frontend/src/config/giftCardBrandCatalog.ts": "Catalog of gift card brands with icons and search terms plus a filter helper.",
  "frontend/src/config/giftCardRatesNGN.ts": "Defines NGN gift card rate tiers, brand overrides, and helpers for tier matching and formatting.",
  "frontend/src/config/vendors.ts": "Vendor rate configurations and logic to select the best vendor by net payout.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates related queries on change.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Re-exports hook for fetching the caller's user profile.",
  "frontend/src/hooks/useDashboardData.ts": "Aggregates user profile, KYC, cards, withdrawals, and transactions into dashboard-ready data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, and identity persistence.",
  "frontend/src/hooks/useNotificationPermission.ts": "Provides a hook to check browser notification support, track permission state, and request permission safely.",
  "frontend/src/hooks/useNotificationSettings.ts": "Manages per‑principal notification preferences with localStorage persistence and toggle support.",
  "frontend/src/hooks/useProfileSetupSuppression.ts": "Tracks and updates whether a user has dismissed profile setup using localStorage per principal.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend interactions with React Query for user profiles and gift cards, including mapping backend types.",
  "frontend/src/hooks/useWalletSummary.ts": "Extracts wallet balance and currency from the caller's user profile.",
  "frontend/src/index.css": "Defines Tailwind base layers and theme variables for light and dark modes.",
  "frontend/src/lib/utils.ts": "Provides class name merging plus helpers for currency formatting and date formatting.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/admin/AdminKycReviewPage.tsx": "Admin tool to look up a user by principal, view their KYC records, and update each record’s status.",
  "frontend/src/pages/admin/AdminWithdrawalsPage.tsx": "Admin interface for viewing pending withdrawal requests and approving or rejecting them.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the dashboard with balance display and shortcut tiles, using dashboard data and formatting utilities.",
  "frontend/src/pages/giftcards/__tests__/addGiftCardNGNRateSummary.test.tsx": "Empty test file placeholder for NGN rate summary behavior.",
  "frontend/src/pages/giftcards/addGiftCardNGNRate.ts": "Computes the matching NGN rate tier for a brand and amount by parsing input and selecting the correct tier.",
  "frontend/src/pages/giftcards/AddGiftCardPage.tsx": "Form for adding a new gift card with brand, currency, amount, code, optional image upload, and NGN rate preview.",
  "frontend/src/pages/giftcards/GiftCardDetailPage.tsx": "Displays detailed info for a gift card, including status, tags, and NGN rate table, with controls to update status and labels.",
  "frontend/src/pages/giftcards/GiftCardsListPage.tsx": "Shows a filterable list of all gift cards using label-based filtering and links to add or view cards.",
  "frontend/src/pages/giftcards/HottestCardsPage.tsx": "Ranks and displays gift cards by their best NGN rates and provides navigation to add or view cards.",
  "frontend/src/pages/giftcards/hottestCardsRanking.ts": "Provides logic to compute best NGN rates per brand and rank gift cards deterministically by rate and metadata.",
  "frontend/src/pages/giftcards/SellGiftCardPage.tsx": "Allows selling a gift card by entering an amount, selecting a vendor, and viewing conversion details based on NGN rates.",
  "frontend/src/pages/HistoryPage.tsx": "Displays locally stored transactions and updates the view when new transactions are added.",
  "frontend/src/pages/KycPage.tsx": "User KYC page allowing document upload, status viewing, and submission with file-size checks and upload progress tracking.",
  "frontend/src/pages/services/AirtimePage.tsx": "Form page for purchasing airtime, capturing provider, phone, and amount, and logging the transaction locally.",
  "frontend/src/pages/services/BettingPage.tsx": "Betting top-up form with provider selection, account ID, amount entry, and a review step before logging a pending local transaction.",
  "frontend/src/pages/services/BillsPage.tsx": "Bills category selection page showing tiles that navigate to various service payment pages.",
  "frontend/src/pages/services/CableTvBillsPage.tsx": "Placeholder cable TV bill payment form that logs a pending transaction after submitting smartcard number and amount.",
  "frontend/src/pages/services/CryptoWalletPage.tsx": "Crypto wallet dashboard showing balances, token list, activity, and sheets for send, receive, buy, swap, and bank transfer actions using mock data.",
  "frontend/src/pages/services/DataPage.tsx": "Placeholder mobile data purchase form that logs a pending transaction using phone number and amount.",
  "frontend/src/pages/services/ElectricityPage.tsx": "Placeholder electricity bill payment form that logs a pending transaction with meter number and amount.",
  "frontend/src/pages/services/WifiInternetPage.tsx": "React page for logging placeholder WiFi/Internet bill payments and storing them as local transactions.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page displaying Internet Identity info and allowing users to enable or disable browser notifications.",
  "frontend/src/pages/withdrawals/WithdrawalsPage.tsx": "UI for managing withdrawals, listing past requests, adding payout methods, and submitting new withdrawal requests.",
  "frontend/src/state/localTransactions.ts": "Manages local transaction storage in localStorage with add, get, and clear helpers.",
  "frontend/src/state/notificationSettingsStorage.ts": "Handles per-principal notification settings using scoped localStorage keys.",
  "frontend/src/types/app-types.ts": "Defines app-wide TypeScript types for users, wallets, transactions, gift cards, KYC, payouts, and withdrawals.",
  "frontend/src/types/process-env.d.ts": "Declares TypeScript types for environment variables injected by Vite.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, themes, animations, and plugin setup.",
  "frontend/vite.config.ts": "Vite configuration for React, environment variables, aliases, build settings, proxies, and dependency optimization.",
  "project_state.json": "Tracks project configuration, existing features, and pending requests related to replacing Firebase with Internet Identity and Motoko-based data persistence. Includes metadata about versions, architectural notes, and planned backend work."
}