{
  "kind": "build_request",
  "title": "Add send-to-bank flow backed by payout methods and withdrawals",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement backend support for bank payout methods so an authenticated user can create and list their payout methods (bank name, account name, account number) with persistent storage.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "User: Yes"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes Candid methods to create a payout method and list the caller’s payout methods",
        "Payout methods are stored per-caller and persist across canister upgrades",
        "Creating a payout method validates required fields and returns a stable unique ID",
        "Unauthorized callers cannot create/list payout methods without being authenticated"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement backend support for send-to-bank (withdrawal requests): allow an authenticated user to create a withdrawal request that references an existing payout method, and allow the user to list their own withdrawal requests.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "User: Yes"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes Candid methods to create a withdrawal request (amount, currency, payoutMethodId) and list the caller’s withdrawal requests",
        "Withdrawal requests default to status 'pending' and include createdAt timestamps",
        "Creating a withdrawal request fails with a clear error if the referenced payout method does not exist or does not belong to the caller",
        "Withdrawal requests persist across canister upgrades"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement backend admin capabilities for send-to-bank processing: allow admins to list all pending withdrawal requests and mark a withdrawal as 'paid' or 'rejected', recording processedAt and processedBy.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "User: Yes"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes Candid methods for admins to list pending withdrawals and update a withdrawal’s status to 'paid' or 'rejected'",
        "Non-admin callers are denied access to admin withdrawal methods",
        "When a withdrawal is processed, processedAt and processedBy are set and status changes are reflected in subsequent queries"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Wire the existing Withdrawals UI to real backend data by updating React Query hooks for payout methods and withdrawals to call backend methods (instead of placeholder implementations), including proper loading and error states.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "User: Yes"
        ]
      },
      "acceptanceCriteria": [
        "Withdrawals page 'Payout Methods' tab can add a payout method and the new method appears in the list without a full reload",
        "Withdrawals page 'Request' tab loads payout methods from the backend and can submit a withdrawal request successfully",
        "Withdrawals page 'History' tab loads withdrawal requests from the backend and displays status/timestamps correctly",
        "Errors from backend calls are surfaced via existing toast patterns and do not crash the page"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add a 'Send to bank' step to the crypto wallet experience by adding a new quick action that opens a bottom-sheet flow for creating a withdrawal request (select currency, enter amount, choose or add payout method, review, confirm).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "User: Yes"
        ]
      },
      "acceptanceCriteria": [
        "Crypto wallet page shows a new quick action labeled 'Send to bank'",
        "Tapping 'Send to bank' opens a bottom sheet with a multi-step flow: input amount/currency, select payout method (and add one if none), review, confirm",
        "On confirm, the app calls the backend to create a withdrawal request and shows a success toast",
        "After success, the flow closes and the user can see the new request in Withdrawals > History"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add conditional state migration support if needed for existing deployed canisters when introducing new stable state for payout methods and withdrawal requests.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "User: Yes"
        ]
      },
      "acceptanceCriteria": [
        "If existing stable state must be upgraded, a migration file is added/updated according to the project’s conditional migration policy",
        "Upgrading from the previous deployed version does not trap and preserves existing authorization/blob-storage state"
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo only if required for upgrade safety",
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT",
    "Use English for all user-facing UI text"
  ],
  "nonGoals": [
    "Integrating with real banking rails, bank verification APIs, or external payment processors",
    "Real-time status updates (no WebSockets/push notifications)",
    "Third-party authentication providers (Internet Identity only)"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}