{
  "kind": "build_request",
  "title": "Redesign login screen to match provided screenshot (email/password style UI using Internet Identity)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the unauthenticated login UI to visually match the provided screenshot: full-screen dark header/background, large white rounded-corner sheet, \"Log in\" title, \"Don’t have an account? Sign up\" row with the \"Sign up\" styled as a link, two large rounded input fields (email + password), a \"Forgot Password?\" link, and a wide rounded \"Continue\" primary CTA at the bottom.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "I want to build my login like that on the screenshot"
        ]
      },
      "acceptanceCriteria": [
        "When logged out, the app renders a login screen that matches the screenshot’s layout and spacing (dark top/background + white sheet + large rounded inputs + bottom CTA).",
        "The layout is mobile-first and remains usable on desktop (content centered with sensible max width).",
        "All user-facing text on this screen is in English and matches the screenshot wording (including capitalization and punctuation) unless Internet Identity constraints require additional clarifying copy (handled in REQ-2)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Preserve Internet Identity as the only authentication method while presenting the screenshot-style form: the \"Continue\" button must trigger the existing Internet Identity login flow (useInternetIdentity().login). Email/password fields must not attempt email/password authentication; instead, treat them as non-auth fields (e.g., optional/disabled or ignored) and provide clear inline/helper messaging so users understand Internet Identity is used (without cluttering the UI).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "I want to build my login like that on the screenshot"
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"Continue\" starts the Internet Identity login flow and shows a loading state consistent with the rest of the app (e.g., spinner + disabled CTA) while loginStatus is \"logging-in\".",
        "No API calls, backend mutations, or local storage mechanisms are introduced for email/password authentication.",
        "A concise, visible explanation indicates that login is via Internet Identity (and not email/password), without reintroducing the old large alert card UI."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement screenshot-like interactions on the login screen: password visibility toggle icon inside the password field, link styling for \"Forgot Password?\" and \"Sign up\", and appropriate disabled/pressed states for the \"Continue\" button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "I want to build my login like that on the screenshot"
        ]
      },
      "acceptanceCriteria": [
        "Password field includes a visibility toggle that switches between masked/unmasked states and is keyboard accessible.",
        "\"Forgot Password?\" and \"Sign up\" are rendered as links/buttons with hover/focus styles and do not break navigation (they may open an informational modal/toast explaining Internet Identity if no dedicated routes exist).",
        "The primary CTA reflects disabled state while logging in and cannot be double-submitted."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (compose existing UI primitives instead).",
    "Do not change authentication away from Internet Identity; do not add email/password authentication.",
    "Keep routing/auth gating behavior in frontend/src/App.tsx intact (still show the login UI when identity is absent)."
  ],
  "nonGoals": [
    "Building a real email/password authentication system.",
    "Implementing full sign-up and password reset backends/flows.",
    "Changing backend Motoko canister logic for authentication."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}