{
  "kind": "build_request",
  "title": "Add full Nigerian bank list for bank-withdrawal payout method selection",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a maintained static list of Nigerian banks in the frontend and use it as the selectable options source for payout-method creation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I want all Nigeria banks to added available for user to make a withdraw into their bank account Nigeria bank available"
        ]
      },
      "acceptanceCriteria": [
        "A new frontend config/module exists that exports an array of Nigerian bank names (strings) suitable for use in UI Select components.",
        "The list is used by all payout-method creation UIs (not duplicated inline in components)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the payout-method creation UI in the \"Send to Bank\" sheet to select a Nigerian bank from a dropdown (with search) instead of free-text entry, while still storing the selected bank name in the existing payout method fields.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I want all Nigeria banks to added available for user to make a withdraw into their bank account Nigeria bank available"
        ]
      },
      "acceptanceCriteria": [
        "In the SendToBankSheet add-method step, the \"Bank Name\" field is a Select-based dropdown populated from the Nigerian banks list.",
        "Users can search/filter the bank dropdown to quickly find a bank name.",
        "Submitting a new payout method stores the selected bank name and it appears correctly in the payout-method list/selection step afterward."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the payout-method creation UI on the Withdrawals page to select a Nigerian bank from a dropdown (with search) instead of free-text entry, while preserving the existing backend payload shape (bankName/accountName/accountNumber).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I want all Nigeria banks to added available for user to make a withdraw into their bank account Nigeria bank available"
        ]
      },
      "acceptanceCriteria": [
        "On the Withdrawals page \"Add Payout Method\" form, the \"Bank Name\" field is a Select-based dropdown populated from the Nigerian banks list.",
        "Users can search/filter the bank dropdown to quickly find a bank name.",
        "Creating a payout method from this page continues to succeed without any backend changes and the selected bank name is displayed in \"Your Payout Methods\" and in the withdrawal request form payout-method picker."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (compose existing shadcn components instead).",
    "Keep the backend single-actor architecture; do not introduce additional canisters/services."
  ],
  "nonGoals": [
    "Adding third-party APIs to fetch Nigerian banks dynamically.",
    "Adding bank verification (e.g., account number/name resolution) or payment rails integration.",
    "Changing backend payout method or withdrawal request schemas."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}