{
  "kind": "build_request",
  "title": "Add Nigerian digital banks and fintechs to withdrawal payout bank list",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Expand the Nigerian bank options used for withdrawal payout methods to include Kuda Bank, OPay, Moniepoint, and PalmPay, and broaden the list to cover Nigerian online/digital banking options so users can select them during payout method creation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Add Kuda bank opay moniepoint ,palm-pay add all Nigeria online banking for payment withdraw"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/config/nigerianBanks.ts` includes entries for: \"Kuda Bank\", \"OPay\", \"Moniepoint\", and \"PalmPay\" (spelled as user-facing names).",
        "The updated list remains the single source of truth used by `NigerianBankSelect`, and the new entries appear in bank search results when typing queries like \"kuda\", \"opay\", \"monie\", and \"palm\".",
        "Users can successfully add a payout method selecting any of these new options from the searchable dropdown in both the Withdrawals flow and the Send-to-Bank sheet, with no UI crashes or validation dead-ends."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text.",
    "Do not edit any files under `frontend/src/components/ui` or other paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep the existing single-actor Motoko backend architecture; do not introduce additional canisters or external services."
  ],
  "nonGoals": [
    "Implementing real payment rails, bank transfers, or third-party payout integrations for Kuda/OPay/Moniepoint/PalmPay.",
    "Adding third-party authentication or wallet integrations.",
    "Changing backend withdrawal/payout schemas unless strictly required for the bank list update (not expected)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}