{
  "kind": "build_request",
  "title": "Require KYC verification before users can withdraw",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Enforce KYC verification on the backend so a user can only create a withdrawal request when their latest KYC record status is verified.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Build KYC verification for users so they can verify the account before withdraw money"
        ]
      },
      "acceptanceCriteria": [
        "Calling createWithdrawalRequest for a user with no KYC records traps with a clear English error message indicating KYC is required before withdrawals.",
        "Calling createWithdrawalRequest for a user whose latest KYC record is pending/rejected/expired/unverified traps with a clear English error message indicating the account is not verified for withdrawals.",
        "Calling createWithdrawalRequest for a user whose latest KYC record is verified succeeds and creates a pending withdrawal request as before.",
        "Admin endpoints (listPendingWithdrawals, updateWithdrawalStatus) and user endpoints (listUserWithdrawals, listUserPayoutMethods) continue to function without behavior changes other than the new KYC gate on withdrawal creation."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Expose a backend query that returns whether the caller is currently KYC-verified (based on the latest KYC record), to support frontend gating and UX messaging.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Build KYC verification for users so they can verify the account before withdraw money"
        ]
      },
      "acceptanceCriteria": [
        "A new query method exists that returns a boolean (or equivalent simple status) indicating if the caller can withdraw (true only when the latest KYC record is verified).",
        "The method is protected so only authenticated users can call it (consistent with other user queries in backend/main.mo).",
        "The method’s result matches the same logic used by createWithdrawalRequest for determining eligibility."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Withdrawals UI to block withdrawal requests unless the user is KYC-verified, and provide a clear call-to-action to complete KYC verification.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Build KYC verification for users so they can verify the account before withdraw money"
        ]
      },
      "acceptanceCriteria": [
        "On the Withdrawals page, if the user is not KYC-verified, the Request Withdrawal form cannot be submitted (submit button disabled and/or form replaced by an explanatory panel).",
        "The Withdrawals page displays an English message explaining that KYC verification is required before withdrawals and includes a button/link that navigates the user to the existing KYC page.",
        "If the user is KYC-verified, the Withdrawals page behaves as it did previously (can select payout method, enter amount, and submit).",
        "If the user attempts to withdraw through any existing UI path and the backend rejects due to KYC gating, the user sees the backend error message surfaced in a toast or inline error in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit any files under frontend/src/components/ui or any other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Integrating with third-party KYC providers or external identity/document verification services.",
    "Adding new authentication methods beyond Internet Identity.",
    "Building real-time notifications for KYC approval/rejection."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}