{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add searchable Nigerian bank dropdowns for payout method creation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a single maintained Nigerian banks static list module and reuse it as the source of truth for payout-method creation UIs.",
      "acceptanceCriteria": [
        "A new frontend config/module exists that exports an array of Nigerian bank names (strings) suitable for use in UI Select components.",
        "The list is used by all payout-method creation UIs (not duplicated inline in components)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/nigerianBanks.ts",
          "operation": "create",
          "description": "Create a maintained static export (e.g., a const array of strings) containing Nigerian bank names, plus optional lightweight helpers (e.g., case-insensitive filter) for searchable selection."
        },
        {
          "path": "frontend/src/components/payout/NigerianBankSelect.tsx",
          "operation": "create",
          "description": "Create a reusable Select-based Nigerian bank picker that imports the Nigerian banks list and provides in-dropdown search/filtering; compose existing shadcn-ui Select/Input components without modifying anything under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace free-text bank name entry in the Send to Bank sheet payout-method add step with a searchable Nigerian bank Select while still storing the chosen name in the existing fields.",
      "acceptanceCriteria": [
        "In the SendToBankSheet add-method step, the \"Bank Name\" field is a Select-based dropdown populated from the Nigerian banks list.",
        "Users can search/filter the bank dropdown to quickly find a bank name.",
        "Submitting a new payout method stores the selected bank name and it appears correctly in the payout-method list/selection step afterward."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/crypto/sheets/SendToBankSheet.tsx",
          "operation": "modify",
          "description": "In the add-method step, replace the Bank Name Input with the reusable NigerianBankSelect component (Select-based, searchable) wired to the existing bankName state so submission continues to send the selected bank name unchanged. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Replace free-text bank name entry on the Withdrawals page Add Payout Method form with a searchable Nigerian bank Select while preserving the existing backend payload shape and downstream displays.",
      "acceptanceCriteria": [
        "On the Withdrawals page \"Add Payout Method\" form, the \"Bank Name\" field is a Select-based dropdown populated from the Nigerian banks list.",
        "Users can search/filter the bank dropdown to quickly find a bank name.",
        "Creating a payout method from this page continues to succeed without any backend changes and the selected bank name is displayed in \"Your Payout Methods\" and in the withdrawal request form payout-method picker."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/withdrawals/WithdrawalsPage.tsx",
          "operation": "modify",
          "description": "Update the Payout Methods tab \"Add Payout Method\" form to use the reusable NigerianBankSelect component for bankName (searchable Select) while keeping the createPayoutMethod call payload shape (bankName/accountName/accountNumber) unchanged; ensure the selected bank name renders in the payout methods list and continues to appear in the request form's payout-method picker. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}