{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Screenshot-style Internet Identity login screen redesign",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Redesign the logged-out login screen layout to match the provided screenshot (dark background + large white rounded sheet, title, sign-up row, email/password fields, forgot link, bottom primary CTA).",
      "acceptanceCriteria": [
        "When logged out, the app renders a login screen that matches the screenshot’s layout and spacing (dark top/background + white sheet + large rounded inputs + bottom CTA).",
        "The layout is mobile-first and remains usable on desktop (content centered with sensible max width).",
        "All user-facing text on this screen is in English and matches the screenshot wording (including capitalization and punctuation) unless Internet Identity constraints require additional clarifying copy (handled in REQ-2)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/LoginCard.tsx",
          "operation": "modify",
          "description": "Replace the current card/alert-based logged-out UI with screenshot-style layout and spacing using Tailwind classes (dark full-screen background/header feel + centered white rounded sheet + required text rows + large rounded email/password fields + bottom full-width rounded primary CTA). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Keep Internet Identity as the only auth method while presenting email/password-style fields; wire Continue to useInternetIdentity().login with loading state and add concise helper copy explaining II.",
      "acceptanceCriteria": [
        "Clicking \"Continue\" starts the Internet Identity login flow and shows a loading state consistent with the rest of the app (e.g., spinner + disabled CTA) while loginStatus is \"logging-in\".",
        "No API calls, backend mutations, or local storage mechanisms are introduced for email/password authentication.",
        "A concise, visible explanation indicates that login is via Internet Identity (and not email/password), without reintroducing the old large alert card UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/LoginCard.tsx",
          "operation": "modify",
          "description": "Ensure the \"Continue\" CTA calls useInternetIdentity().login and reflects loginStatus === 'logging-in' with disabled + spinner/label change; keep email/password fields as non-auth inputs (ignored and/or disabled) and add a short inline helper line (non-card) indicating Internet Identity is used. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add screenshot-like interactions: password visibility toggle, link styling for Forgot Password and Sign up, and robust disabled/pressed CTA states.",
      "acceptanceCriteria": [
        "Password field includes a visibility toggle that switches between masked/unmasked states and is keyboard accessible.",
        "\"Forgot Password?\" and \"Sign up\" are rendered as links/buttons with hover/focus styles and do not break navigation (they may open an informational modal/toast explaining Internet Identity if no dedicated routes exist).",
        "The primary CTA reflects disabled state while logging in and cannot be double-submitted."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/LoginCard.tsx",
          "operation": "modify",
          "description": "Implement a password visibility toggle button inside the password input (keyboard accessible, uses existing icon library already in use), style \"Forgot Password?\" and \"Sign up\" as links with hover/focus states, and prevent double-submission by disabling the CTA while logging in (including active/pressed styling). If no routes exist, have links open a small non-intrusive informational dialog/toast about Internet Identity or an external Internet Identity help/sign-up page. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}