{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Send-to-bank flow wired to backend payout methods and withdrawals",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Replace placeholder React Query hooks with real backend calls for payout methods and withdrawals, including loading/error handling in the existing Withdrawals UI.",
      "acceptanceCriteria": [
        "Withdrawals page 'Payout Methods' tab can add a payout method and the new method appears in the list without a full reload",
        "Withdrawals page 'Request' tab loads payout methods from the backend and can submit a withdrawal request successfully",
        "Withdrawals page 'History' tab loads withdrawal requests from the backend and displays status/timestamps correctly",
        "Errors from backend calls are surfaced via existing toast patterns and do not crash the page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update payout-method and withdrawal React Query hooks to call backend actor methods (listUserPayoutMethods, createPayoutMethod, listUserWithdrawals, createWithdrawalRequest) instead of placeholders; map backend types to the app UI types where needed (e.g., bigint IDs/timestamps), and ensure errors propagate for toast handling. Use the authorization component’s frontend guidance to keep queries disabled until an authenticated actor is available; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/withdrawals/WithdrawalsPage.tsx",
          "operation": "modify",
          "description": "Ensure Withdrawals page correctly reflects hook loading/error states for payout methods and withdrawals (skeletons/disabled controls already present), and align displayed fields (timestamps/status) with the mapped backend data returned by the updated hooks; keep toast-based error surfacing consistent with existing patterns and do not crash on failures."
        },
        {
          "path": "frontend/src/pages/admin/AdminWithdrawalsPage.tsx",
          "operation": "modify",
          "description": "Adjust admin withdrawals UI field usage to match the updated hook return shape produced from backend data mapping (e.g., owner vs user naming and timestamp fields), preserving existing AdminRouteGuard behavior and toast-based error handling."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add a new 'Send to bank' crypto wallet quick action that opens a multi-step bottom-sheet flow to create a withdrawal request using backend payout methods.",
      "acceptanceCriteria": [
        "Crypto wallet page shows a new quick action labeled 'Send to bank'",
        "Tapping 'Send to bank' opens a bottom sheet with a multi-step flow: input amount/currency, select payout method (and add one if none), review, confirm",
        "On confirm, the app calls the backend to create a withdrawal request and shows a success toast",
        "After success, the flow closes and the user can see the new request in Withdrawals > History"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/crypto/sheets/SendToBankSheet.tsx",
          "operation": "create",
          "description": "Create a new bottom-sheet (using the existing shadcn-ui Sheet component) implementing the multi-step 'Send to bank' flow: amount/currency entry, payout method selection (with inline add payout method), review, and confirm; on confirm call the existing withdrawal mutation hook and surface success/error via toasts. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/crypto/CryptoQuickActions.tsx",
          "operation": "modify",
          "description": "Add a new quick action button labeled 'Send to bank' and a corresponding callback prop (e.g., onSendToBankClick), keeping the existing actions intact and ensuring the layout accommodates the additional action."
        },
        {
          "path": "frontend/src/pages/services/CryptoWalletPage.tsx",
          "operation": "modify",
          "description": "Wire the new 'Send to bank' quick action to open/close the SendToBankSheet, manage its open state alongside other action sheets, and render the new sheet component so it is reachable from the wallet experience."
        }
      ]
    }
  ]
}