{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-08T01:05:50.555Z",
  "summary": "Frontend Withdrawals page appears to add a KYC verification gate via a new `useIsCallerKycVerified` hook and shows user-facing English errors. However, the diff summary does not provide clear evidence that the backend now enforces the KYC gate inside `createWithdrawalRequest`, nor that a new authenticated backend query exists to return the caller’s KYC-withdrawable eligibility.",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "Enforce KYC verification on the backend so a user can only create a withdrawal request when their latest KYC record status is verified.",
      "reason": "The provided `backend/main.mo` excerpt shows KYC record types and `submitKycRecord`/`getKycStatus`, but does not show any change to `createWithdrawalRequest` to check latest KYC status and trap with the required English error messages when not verified. Because the backend file is truncated, this requirement cannot be confirmed from the diff summary.",
      "evidence": [
        "backend/main.mo (truncated; no visible `createWithdrawalRequest` gating logic)"
      ]
    },
    {
      "id": "REQ-2",
      "requirement": "Expose a backend query that returns whether the caller is currently KYC-verified (based on the latest KYC record).",
      "reason": "Frontend code imports/uses `useIsCallerKycVerified`, but the backend diff excerpt does not show a corresponding new query method that returns a boolean/simple eligibility status, nor its authentication guard. With the backend diff truncated, existence/logic cannot be verified from the summary.",
      "evidence": [
        "backend/main.mo (truncated; no visible boolean KYC-eligibility query)",
        "frontend/src/pages/withdrawals/WithdrawalsPage.tsx (uses `useIsCallerKycVerified`)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Broad refactor/expansion of frontend React Query hooks and type-mapping utilities beyond the requested KYC-withdrawal gating (e.g., mappings for gift cards, document types, withdrawal status conversions, and other unrelated queries).",
      "reason": "BuildRequest only asks for a KYC-withdrawal gate and a backend query for KYC eligibility; the diff shows additional/generalized mapping helpers and commentary indicating wider backend/frontend type changes.",
      "evidence": [
        "frontend/src/hooks/useQueries.ts (truncated; multiple mapping helpers and non-KYC-related logic)"
      ]
    }
  ],
  "confidence": 0.58,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/pages/withdrawals/WithdrawalsPage.tsx",
    "project_state.json"
  ]
}